{"article/ao-gaming-chain":{"title":"AO is shaping up to become a gaming chain","links":["reference/arweave","reference/ucm","reference/vouch","article/legacynet-mainnet-transition","reference/gateways","reference/ao","article/permaweb-index"],"tags":[],"content":"\nI. Introduction\nAO offers technical infrastructure that other blockchains simply can’t. The ability to run unlimited processes in parallel, without waiting for a global queue to execute, unlocks new opportunities for builders. Gaming on AO is one of the most exciting areas to watch. This post explores why AO is positioned to become a leading gaming chain.\nII. Fully onchain games\n\nStarGrid Battle Tactics just launched the private beta for its new 1v1 strategy game. Their motto? Making a crypto game that doesn’t suck.\nA core belief of the team is that most crypto games fail because they aren’t truly onchain, defeating the purpose of building in crypto in the first place. On top of that, many rely on unsustainable incentives, depending on the memability of in-game NFTs and token drops rather than solid game mechanics.\nStarGrid is taking a different approach by building its game fully onchain, every single interaction is a transaction on AO, permanently stored on Arweave. This is possible because each game instance spawns AO processes that run in parallel, never competing for execution.\nThe StarGrid private beta just went live on March 25, 2025. If all goes well, StarGrid could set the bar for truly onchain gaming.\n\nAnother game currently in beta testing is Dumverse, an adventure game featuring the beloved Dumdumz elephant NFTs in a beautifully animated world. All game data is stored on Arweave and runs on AO. Test out the beta here.\nFully onchain games, and fully onchain applications in general, ensure that games remain permanently accessible and censorship-resistant. If a game isn’t truly onchain, what’s the point of building it in Web3 at all? Without decentralization as a priority, it would be far easier to take the Web2 route.\nIII. Composable protocols\nThe permaweb prioritizes protocols over products. Instead of siloed applications, developers build interoperable protocols that anyone can integrate. Some key examples:\n\nUniversal Content Marketplace (UCM) – A trustless, onchain order book protocol for exchanging digital content\nReality Protocol – A framework for building 2D worlds powered by AO and Arweave\nStamps Protocol– A universal “like” button for the permaweb\nVouch Protocol – A proof-of-humanity verification system\n\nThese composable protocols solve the cold start problem for consumer web applications. Developers can leverage existing data pools, while users enjoy a seamless, interconnected experience.\nAnother project to watch is Basejump, which is developing a gaming substrate called $ACTION. It aims to enable the creation and interoperability of digital worlds, games, assets, and communities. See their whitepaper here.\n\n  \n\nIV. LLMs in a single process\n\nLlamaland, built on Reality Protocol, showcases how AI can run in a single AO process.\nIn this MMO game, players must petition the Llama King to receive $LLAMA tokens. The twist? The Llama King is actually an AI agent that evaluates petitions and only rewards worthy players. This AI banker is an instance of LLAMA-3, running entirely within a single AO process.\nThis experiment demonstrates how AO supports onchain AI, rather than just storing AI-related data while relying on offchain resources. While most blockchains integrate AI as a buzzword, AO actually makes it possible.\nBeyond gaming, AI-driven finance (AgentFi) is emerging, with DeFi platforms integrating onchain AI bots that make automated, verifiable decisions. The same concept could extend to AO-based games, introducing a new dynamic to crypto gaming.\nV. Games to watch\nA few games to watch out for in 2025:\n\nStarGrid Battle Tactics - 1v1 strategy game\nDumverse - Adventure game based on the popular DumDumz NFT collection\nBasejump - Developing the $ACTION gaming substrate for interoperable digital worlds\nRuneRealm - MMORPG built on Reality Protocol\n\nVI. Challenges and how AO compares to other gaming chains\nMost crypto gaming chains focus on scalability and asset ownership, but AO goes a step further by enabling fully onchain games where every action is recorded as an immutable transaction stored on Arweave. Platforms like Ronin and Immutable are optimized for low-cost NFT transactions with little to no gas fees, but they rely heavily on offchain game logic to maintain performance. Because most chains depend on a global shared state, scaling fully onchain applications, especially games, remains a significant challenge.\nAO’s approach avoids this bottleneck by allowing unlimited parallel processes without global state contention. However, the AO ecosystem faces its own challenges, particularly around infrastructure stability. With AO currently transitioning from legacynet to mainnet, much of the stack is still evolving.\nThe upside is that game developers on AO can own their entire stack, from gateways and compute nodes to AR-based domain names, giving them unmatched control and flexibility.\nAnother hurdle is timing. AO is still early, and consumer-facing applications haven’t yet achieved mainstream recognition. For games to succeed, they’ll need more than strong tech. They need strong IP and compelling experiences. Projects like Basejump and Dumdumz, which build on existing NFT communities, have a start with core supporters. But in the end, success will come down to making fun, replayable games, not just offering the potential to earn.\nVII. Conclusion\nAO’s ability to run parallel processes, its emphasis on composable protocols, and its support for fully onchain AI make it an ideal environment for crypto gaming. As more projects integrate AO’s tech stack, we’re witnessing the rise of the first true gaming chain, one that doesn’t just tokenize assets but puts the entire game onchain.\nIf games can be built on AO, anything can be built on AO. Watch out for permaweb gaming.\nFurther reading\n\nAO 101\nPermaweb Index\n"},"article/ao-mainnet-live":{"title":"AO mainnet is live","links":[],"tags":[],"content":"\nAO mainnet is live. With many new updates to AO, there’s a lot to unpack. this post offers a high-level overview of what’s new and introduces AO’s ecosystem funding model, the Permaweb Index (PI).\nWhat is AO?\nAO is a hyper-parallel decentralized computer inspired by the actor-oriented paradigm. Unlike traditional blockchain computation models, AO scales efficiently through parallel processing, reducing redundancy while ensuring network verifiability and minimizing trust requirements.\nSince February 2024, AO has been running on testnet, allowing users to interact with the network without fees while testing and refining the protocol. Now, AO is live on mainnet.\nWhat’s New?\n\nAO-Core\nAO Token is transferable\nPermaweb Index (PI)\n\nAO-Core\nAO-Core is a new powerful protocol that embeds blockchain-style computation verification directly into the internet’s infrastructure, specifically within the HTTP transport layer.\nThis means that every web request, whether loading a webpage or interacting with an API, can function as an AO transaction. Instead of requiring separate blockchain integrations, AO is seamlessly embedded into the existing web stack.\nWhy does this matter?\nThe internet has 5.5 billion users, while all blockchains combined have around 300 million. By integrating with existing web standards, AO can tap into this massive user base without friction.\nThis is enabled by HTTP Message Signatures, a new internet standard formalized last year. It allows native signing and verification of HTTP requests, making AO transactions verifiable and transparent without altering how people already use the web.\nAdditionally, AO eliminates the need for oracles. Since AO operates as a decentralized web server, data exchange between AO processes and the wider internet happens natively, without relying on third-party intermediaries.\nScaling without redundancy\nTraditional blockchain networks like Ethereum and Solana rely on repeated execution of the same programs across multiple nodes, which limits scalability. AO, however, increases overall computational power as new hardware joins the network.\nTrusted Execution Environments (TEE)\nA Trusted Execution Environment (TEE) is like a CPU with the security of a hardware wallet. It ensures that computations occur in a protected space where even the hosting machine cannot see or alter the data being processed.\nCompared to Zero-Knowledge Proofs (ZKPs) and Fully Homomorphic Encryption (FHE), which provide privacy but with significant performance trade-offs, TEEs deliver high security with minimal computational overhead.\nHow TEEs work in AO\n\nAttestations of correctness – TEEs can verify computations efficiently, even stacking across multiple hardware manufacturers for added trust.\nPrivate computation – Users can run secure applications without revealing underlying data, similar to encrypted transactions but with real-time processing.\n\nThis approach brings blockchain-level verifiability to AI, finance, and other data-sensitive industries, without the massive computational costs of traditional cryptographic methods.\nAO fair launch token\n\nAO follows a 100% fair launch model, no pre-mined tokens, no insider allocations. Instead, AO tokens are earned through network participation.\nNow that 15% of AO tokens have been mined, the token can now be transferred. Depositors can still bridge assets like stETH and DAI into AO’s pre-bridge system or hold AR to continue earning AO tokens.\nAO’s native yield mechanism supports both ecosystem builders and core development efforts, aligning long-term incentives for all participants.\nPermaweb Index (PI)\n\nThe Permaweb Index (PI) acts as a default means of exchange on the permaweb, offering broad exposure to the entire ecosystem without active management. PI is a token representing ownership of key permaweb assets:\n\n1/3 AO\n1/3 AR\n1/3 fair-launch projects\n\nHow PI works\n\nAny staked asset depositor or Arweave holder can delegate AO yield to new fair launch projects.\nIn return, they receive a portion of those projects’ fair launch tokens.\nThis enables projects to distribute 100% of their tokens to users while still securing development funding.\n\nThis DeFi technology built by Autonomous Finance uses a combination of smart algorithms and autonomous agents to manage liquidity.\nUnlike traditional VC funding, this model eliminates zero-sum competition and fosters collaborative growth across the ecosystem.\nFair launch projects\n\nOn the AO mint site, you can customize your rewards by adjusting the mix of PI, AO, and/or AR you earn, as well as selecting specific tokens from participating permaweb projects. These preferences will take effect on March 14th; until then, rewards will be issued in AO tokens.\nThe following projects are participating in the first fair launch, with more details on how to participate coming soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProjectDescriptionApus NetworkDecentralized AI platform utilizing AO and Arweave for deterministic GPU computing.ar.ioFirst permanent cloud network providing permanent data storage and web hosting.BasejumpScalable, permissionless AI gaming substrate.BazarDigital content marketplace built on AO’s Universal Content Marketplace (UCM), a decentralized order book for creators.BotegaAI-powered DEX leveraging autonomous agents for optimized liquidity and advanced order execution.Protocol.LandDecentralized source control platform for building and deploying applications and protocols.\nSummary\nAO mainnet is live, introducing AO-Core, a tradeable AO token, and the Permaweb Index (PI) among many more updates. AO-Core embeds blockchain-style verifiability into the internet’s transport layer, enabling scalable decentralized computation. The AO token, launched through a fair launch distribution, is now tradeable, rewarding ecosystem participation.\nPI offers a new funding model, providing exposure to AR, AO, and fair-launch project tokens, fostering collaboration across the permaweb. Several projects are already leveraging AO’s fair launch model for decentralized marketplaces, AI, and permanent cloud infrastructure.\nAO mainnet is a major step toward a more scalable, verifiable, and decentralized web. Learn more about the next steps for AO development in this article. Stay updated by following AO on X.\n\nThis is not financial advice. Please do your own research.\nOriginal post: paragraph.xyz/@afmedia/ao-mainnet-is-live"},"article/ao-message-passing-explained":{"title":"AO message passing explained","links":[],"tags":[],"content":"\nIf you’ve been exploring AO applications, you’ve likely encountered the term “message,” especially when reviewing transactions on ao.link. Diving into the messages on ao.link can feel overwhelming, especially if you’re just trying to confirm that your transaction went through.\nThis guide explains why messages on AO differ from other blockchains and how AO’s unique approach to parallel execution unlocks unmatched scalability and efficiency.\nWhat is shared memory?\nMany blockchains use shared memory, where all smart contracts access the same memory space. This design allows contracts to read and write data directly, making certain operations simpler. However, it introduces a significant limitation: lock contention.\nLock contention happens when multiple users try to access and modify the same data simultaneously. To avoid conflicts, processes must take turns. For example:\n\n\nAlice locks the data, makes her changes, and unlocks it.\n\n\nOnly then can Bob access and modify the data.\n\n\nWhile this system works well at smaller scales, it becomes a bottleneck as network usage grows.\n\nSimple diagram illustrating lock contention, sourced from this blog.\nHow does AO message passing work?\nAO uses a fundamentally different approach. Instead of relying on shared memory, smart contracts on AO operate as independent, asynchronous processes.\n\n\nEach contract runs independently and communicates with others by sending messages.\n\n\nThese messages are stored permanently and verifiably on Arweave, ensuring security and transparency.\n\n\nThis design removes the need for a global memory space where processes compete for access, effectively eliminating lock contention.\nTo help visualize this system, the diagram below illustrates how messages flow through units on the network.\n\nDiagram illustrating AO message passing, sourced from the AO cookbook.\nThese units form the foundation of AO and collectively operate the AO Operating System (aos). Without diving too deep into the technical side, here’s a high-level overview of the three unit types:\n\n\nMessager Unit (MU): Acts as the entry point, receiving external messages, managing communication between processes, and forwarding messages to the Scheduler Unit (SU).\n\n\nScheduler Unit (SU): Ensures messages are properly sequenced and stored on Arweave for consistent replay and verification.\n\n\nCompute Unit (CU): Handles the heavy lifting by performing computations, managing memory, and returning results to the MU for further processing.\n\n\nThese units can exist in multiples across the network, working together to run aos efficiently and securely.\nHow AO processes scale\nEach AO process operates on the speed of a single CPU thread. When a process becomes too busy, it can split into multiple processes to handle the workload, a method called horizontal scaling.\nFor example, users familiar with Bazar know it runs on the Universal Content Marketplace (UCM) protocol. During the AO testnet, the UCM process experienced high traffic, which occasionally slowed performance. To solve this, UCM is being horizontally scaled into sub-orderbooks, meaning every atomic asset listed for sale will have its own UCM process.\nThis scalability allows AO to handle increased traffic and complexity without slowing down.\nTrade-offs\nThe main trade-off of message passing is the lack of instantaneous access to shared global memory. Instead, processes must “ask” for information by sending and receiving messages from other processes.\nWhile this introduces additional complexity, AO developers have worked hard to make these interactions efficient and seamless. A major focus during the AO testnet phase has been improving infrastructure and the developer experience. These advancements have enabled consumer app developers to enhance the user experience of their applications. You can explore the rapidly growing permaweb ecosystem here.\nAs we continue developing Bazar and other user-facing applications, we aim to make the user experience as seamless as possible. This involves what I like to call as “hiding the wires” so users can enjoy the platform without unnecessary friction.\nConclusion\nAO’s approach to message passing eliminates the bottlenecks of shared memory systems. Instead of competing for access to a single thread of execution, processes communicate asynchronously and in parallel.\nIf this all sounds complex, you’re not alone, and frankly these are technical intricacies most users don’t care about as long as the system works and remains decentralized. That’s why it’s essential to continue abstracting away the complexities and building platforms that are both user-friendly but not compromising on decentralization.\nThis post was inspired by this tweet from Sam Williams, the founder of Arweave/AO.\n\nThis is not financial advice. Please do your own research.\nOriginal post: paragraph.xyz/@afmedia/how-message-passing-works-on-ao"},"article/ao-nomenclature":{"title":"AO release nomenclature explained","links":[],"tags":[],"content":"\nAO mainnet went live in February 2025, introducing AO-Core and early access to the HyperBEAM operating system. The launch sparked mixed reactions, as many were unclear about the status of the mainnet implementations. AO founder Sam Williams addressed these concerns in a recent AO Node onboarding workshop, and I want to highlight a few of his key points here.\nAO mainnet status\nLike many ecosystem projects, AO follows a standardized software release cycle, categorizing protocols into the following phases:\n\nPreview: The protocol is available for users to try and provide feedback on but is expected to change.\nEarly: The protocol is considered feature-complete by its developers, though small tweaks may still be needed.\nCandidate: The initial developers believe no further changes to the core protocol are necessary. At this stage, protocols offer real, enforceable rights to their end users.\nStable: The community has largely agreed that the protocol will not change in the future. This usually happens when a disagreement forces the protocol to ossify.\n\nThe following graphic illustrates the current AO-Core stack as of February 25. Candidate-phase components (AO-Core, Arweave) are in green. Preview-phase components (HyperBEAM) are in orange. Early Access implementations (security, payments, execution) are in red.\n\nMilestone 1: AO-Core\nOn February 9, AO reached Milestone 1, with AO-Core achieving Candidate status. This milestone introduced payment infrastructure, allowing users to pay operators for “fast lane” computation. These payments are already integrated into key developer tools, including AOS and aoconnect.\nAO-Core embeds blockchain-style computation verification directly into the internet’s infrastructure, specifically within the HTTP transport layer, rather than creating a separate network. While blockchains collectively have around 300 million users, the internet has 5.5 billion. By integrating with existing web standards, AO can seamlessly tap into this vast user base. More on AO-Core here.\nMilestone 2: HyperBEAM\nOn February 25, early access to Milestone 2 was released, introducing HyperBEAM-resident compute with embedded CUs. This enables AO processes to run natively inside HyperBEAM, leveraging its built-in scheduling, messaging, and compute devices for the first time. Node operators can now execute these devices in TEE-enabled environments, ensuring verifiable hashpath attestations.\nHyperBEAM is a modular operating system for AO-Core, allowing node operators to choose which AO devices to run and offer them to users for a fee. These devices function as blockchain-like modules that can be combined to build applications, managing compute execution while abstracting hardware provisioning for developers. More on HyperBEAM here.\nWhat this means for the permaweb ecosystem\nMany permaweb applications still run on AO legacynet. Since all legacynet transactions are permanently stored on Arweave, the data remains accessible and can continue to be used as long as the infrastructure is supported.\nThe transition to HyperBEAM nodes is happening seamlessly, without downtime, as both systems share the same underlying data structures on Arweave, ensuring interoperability.\nLegacynet allowed developers to experiment without transaction fees, but as demand grew, congestion became a problem. With no transaction fees and uncapped user demand, congestion was inevitable. Many applications had to implement workarounds that are no longer necessary on mainnet.\nAO-Core now introduces a payment mechanism for sending messages, ensuring a sustainable network. Permaweb applications are actively transitioning to HyperBEAM as they adapt to this model.\nChallenges of the AO mainnet launch\nThe AO mainnet launch faced mixed reactions, partly due to the complexity of the technology and communication gaps leading up to the release.\nAO is radically different from existing blockchain architectures. Most popular blockchains use a global shared state, which have already proven to be unscalable. AO upends conventional blockchain development for a new actor-oriented approach. This comes with new challenges to develop and communicate to the world.\nThe AO team is also learning from the mistakes of other crypto ecosystems. Many projects prioritize rapid user adoption and “hype” early in their launch cycles to validate their concepts and keep investors happy. This approach is ultimately shortsighted. Ethereum’s scalability issues were evident early on, but the ecosystem had already grown too large to pivot to a more scalable architecture.\nThe AO team was aware of this dilemma and sought to avoid it at all costs. After just a few months of testnet, the team was already working on a completely new implementation of AO. This came at the cost of communication. Since these changes were actively in development, the team couldn’t fully share them with the community in real time. As a result, the mainnet launch may have felt abrupt for some in the ecosystem.\nIf AO had remained unchanged for longer, the transition to mainnet would have been even more difficult. Now that mainnet is live, the AO team is focused on developer documentation and community resources to ensure a smooth migration from legacynet to AO-Core.\nWhat’s next?\nAO has already processed 1.5 billion messages since launch, laying the foundation for an expanding ecosystem. Key developments ahead include:\n\nCommunity-built devices: Developers are adding new capabilities, including GPU-based implementations.\nLegacynet compatibility: Existing processes will soon be able to run inside HyperBEAM nodes, easing the transition to AO-Core.\nThe Green Zone: A secure TEE-enabled node network, where operators stake AO tokens for participation.\nOptimized WASM execution: Ahead-of-Time (AOT) compilation will bring near-native execution speeds.\n\nConclusion\nThe AO mainnet launch was a significant step forward, though not without challenges. Following a clear software release framework helps clarify where AO and its components stand today. This standardized release approach is also adopted by ecosystem projects, helping users understand the status of tools and applications they use.\nHave questions about AO or want to connect with the community? Join the AO Discord. Want to run a HyperBEAM node? Check out the HyperBEAM Discord.\n\nThis is not financial advice. Please do your own research.\nOriginal post: paragraph.xyz/@afmedia/ao-release-nomenclature-explained"},"article/ao-permaweb-guide":{"title":"The role of AO in the permaweb ecosystem - A beginner’s guide","links":["reference/arweave","reference/gateways","reference/ao","reference/vouch","reference/zones","reference/ucm","reference/udl","reference/permaweb","article/permaweb-index"],"tags":[],"content":"\nI. Introduction\nThe permaweb is a permanent and decentralized web built on top of Arweave. The original vision of the traditional web was to create an accessible repository of human knowledge. While it has been largely successful, a critical flaw remains: the web lacks permanence. When documents are removed from a server, they are lost to the collective knowledge base. Similarly, applications that once operated on the web become inaccessible when their developers or maintainers alter or remove them.\nThe permaweb solves this by ensuring that all data, applications, and interactions remain available forever. However, to create a fully decentralized alternative to the web, permanent storage alone is not enough. We need a scalable, trustless computational layer that enables applications to run without reliance on centralized servers. This is where AO comes in.\nII. What is AO?\n\nAO is a “hyper-parallel computer” designed to provide secure and scalable computing power. It combines the reliability of blockchain technology with the efficiency and speed of traditional cloud services. Think of it as a decentralized cloud computing platform that allows developers to deploy applications and execute computations without trusting centralized infrastructure. AO enables permissionless, onchain execution at any scale, supporting everything from simple scripts to complex, high-performance applications.\nUnlike traditional blockchain-based smart contract platforms, which often suffer from scalability limitations and high costs, AO is designed to handle vast amounts of parallel processing. This makes it an essential building block for the next generation of decentralized applications (dApps).\nIII. What is the permaweb?\n\nThe permaweb is a decentralized, permanent web built on Arweave. It offers a complete stack for building and running applications that do not rely on centralized servers. The key components of the permaweb include:\n\nArweave: The storage layer that ensures data replication and availability through a decentralized, sustainable endowment model.\nGateways: Content delivery servers with diverse business models and incentives (e.g., arweave.net, ar.io, g8way.io, and aoweave.tech).\nGraphQL: A querying system offered by gateways, enabling seamless interaction with the network’s data. Developers can use GraphQL to search posts by users, filter data by tags or timestamps, and more, much like traditional web applications.\nAO: A hyper-parallel computational layer that provides a unified environment for decentralized applications and processes.\n\nBeyond the core components, there are open protocols built on Arweave’s robust data lake, enabling composable applications that can seamlessly leverage and build on each other’s data.\nOpen protocols and frameworks include:\n\nStamps: A universal “like” button for content on the permaweb.\nVouch: A decentralized proof-of-humanity system.\nZones: A composable user profiles and digital entity framework.\nUniversal Content Marketplace (UCM): A decentralized order book for transacting digital assets on the permaweb.\nUniversal Data License (UDL): A programmable content licensing framework that can be attached to any piece of permaweb data.\n\nLearn more about the permaweb here.\nIV. How does AO fit in the permaweb?\nAO brings decentralized, onchain computation at scale to the permaweb. While Arweave ensures data permanence, AO enables applications to process and compute data without relying on centralized services. Think of AO as the CPU and Arweave as the hard drive that makes up the permaweb computer. AO unlocks a wide range of new possibilities for permaweb applications, including:\n\nDynamic dApps: Applications that require real-time or interactive elements, such as deFi, gaming, social media and more.\nDecentralized AI: Training and running AI models in single smart contracts without centralized control.\nAutomated Processes: Trustless execution of smart contracts and workflows that can interact with permaweb data in parallel.\n\nBy leveraging AO, developers can build applications that are not only permanent but also highly scalable and autonomous.\nV. Looking ahead, what’s next for the permaweb?\n\nAO-Core &amp; HyperBeam\nPermaweb applications have been running on AO legacynet since February 2024, giving developers a chance to experiment with this new programming environment. However, as expected on any testnet challenges emerged, most notably, congestion on compute units (CUs) caused by excessive message traffic from users and applications. When sending messages is free, it can be abused, leading to inefficiencies.\nNow that AO is on mainnet, AO-Core offers a flexible framework for running various computational models without enforcing a single architecture. Furthermore, HyperBeam, an Erlang-based node implementation of the AO-Core protocol, is now live. Node operators are providing computation services to the network using HyperBeam, and applications on AO mainnet will now require gas fees to send messages. This change enhances network reliability and further decentralizes the system as more node operators come online.\nPermaweb Index\nOn the application layer, the Permaweb Index is live and the fair launch UI is launching soon. The Permaweb Index is a decentralized funding mechanism that enables users to allocate AO yield to Permaweb projects in exchange for PI tokens. Unlike traditional VC funding or token presales, this model ensures ongoing community support rather than one-time investments.\nVI. Conclusion\nArweave offers an entirely new understanding of how we store and access data, ensuring that digital knowledge is never lost. However, to fully realize the vision of a decentralized web, we need computation that is just as permanent and trustless as the storage layer. AO fulfills this role by providing scalable, onchain execution, enabling a new generation of decentralized applications.\nAs the permaweb ecosystem grows, AO will continue to play a critical role in ensuring that applications can run efficiently and securely, without reliance on centralized infrastructure. Together, AO and Arweave are laying the foundation for a more open, transparent, and resilient internet.\nFollow AO on X to stay up to date on the hyper parallel computer."},"article/ao-yield":{"title":"How to allocate AO yield in the Permaweb Index","links":["article/permaweb-index"],"tags":[],"content":"\nThe Permaweb Index launched on 3.14 (Pi Day), introducing a new model for funding crypto projects. Users can allocate their AO yield to Permaweb Index projects to earn PI tokens. This guide explains how to allocate AO yield step by step.\nWhat is the Permaweb Index?\nThe Permaweb Index introduces a fair launch funding mechanism, allowing the community to support projects while enabling builders to secure sustainable development funding.\nThe PI token acts as a default means of exchange across the permaweb, offering broad exposure to the ecosystem without requiring active management. Each PI token represents ownership in key permaweb assets:\n\n33.3% $AR (Arweave)\n33.3% $AO (AO)\n33.3% Fair launch projects\n\nMore info on the Permaweb Index here\nHow does AO yield work?\nYour AO allocation is determined by a combination of:\n\nYour Arweave (AR) holdings in a self-custody wallet\nYour deposited assets (e.g., stETH, DAI)\n\nWhen you bridge stETH or DAI to AO, your original deposit remains in a trustless, audited contract on Ethereum while the native yield is distributed to support ecosystem projects and builders, helping fuel AO’s growth. Your assets can be withdrawn at any time.\nMore info on the economics of AO here.\nHow to deposit stETH and DAI to accrue AO\n\nGo to the AO Mint page.\nConnect ETH Wallet in the Deposits section.\nDeposit stETH or DAI by entering the amount.\n\nIf you don’t have stETH or DAI, swap other tokens for stETH or DAI before depositing.\n\n\nEnter the Arweave wallet address where you want to receive AO tokens.\nSign the transaction in your Ethereum wallet to confirm the deposit.\nReceive AO tokens directly in your Arweave wallet.\n\n\nHow to allocate AO yield\nAO allows you to customize how you allocate your yield. On the Yield page, you can choose:\n\nPI: Receive a diversified allocation: 1/3 AO, 1/3 Arweave (AR), 1/3 ecosystem project tokens\nAO: Keep earning AO. Your AR holding yield and deposits will continue accruing AO without reallocation.\nAR: Convert your AO yield into Arweave (AR), which can be used for permanent data storage.\n\nFair Launch token customization\nUnder “Choose Your Yield”, you can further customize by selecting specific fair launch projects to allocate your yield.\n\nClick Details &amp; Add under a project description to allocate AO yield to that project.\nThe PI allocation chart (on the right) updates in real time.\nOnce satisfied with your allocation, click Save Changes.\n\n\nWhat does it mean to allocate AO yield to fair launch projects?\nAllocating your AO yield to an ecosystem project directs your accrued yield to fund its development. In return, you receive the project’s fair launch token, giving you a stake in its growth. This model ensures a more equitable funding system, allowing builders to raise capital without traditional gatekeepers while letting users participate in the project’s early success.\nSummary\nThe Permaweb Index introduces a new model for funding crypto projects. By allocating AO yield to Permaweb Index projects, users earn PI tokens, which provide diversified exposure to key permaweb assets.\nWhen the Permaweb Index is live on PI Day (3.14) users can customize their yield allocation to receive AO, AR, PI, or specific fair launch project tokens, ensuring a flexible and fair funding mechanism for both builders and the community.\nResources\nAO\n\nWebsite\nX\nMirror\n\nAutonomous Finance\n\nWebsite\nX\n\nPermaweb Index Projects\n\nApus Network\nar.io\nBasejump\nBazar\nBotega\nProtocol.Land\n\n\nThis is not financial advice. Please do your own research."},"article/hyperbeam-milestone-3":{"title":"Legacynet SU compatibility: What this latest update means for HyperBEAM","links":["article/ao-nomenclature","article/ao-mainnet-live","article/ao-message-passing-explained"],"tags":[],"content":"\nI. Introduction\nAO-Core is a decentralized computing protocol designed to break away from traditional, centralized cloud models. Instead of relying on a single architecture, AO provides a flexible framework where multiple computational models, or devices, can interact. This approach enables trustless, scalable, and censorship-resistant computation.\nThe latest milestone in AO’s evolution is that legacynet processes can now execute on HyperBEAM. Until now, these two networks operated in isolation.\n\n  \nII. What this update enables\nPreviously, AO processes on legacynet and HyperBEAM ran separately, unable to interact. With this latest update, AO-Core can now directly execute and interact with existing legacynet-scheduled processes. This means:\n\nLegacynet processes can now run on HyperBEAM while still returning results to the legacynet environment.\nComputed messages can be exchanged between legacynet and mainnet processes, enabling seamless interoperability.\nHyperBEAM nodes now support decoding, scheduling, and storing messages using both AO’s standard HTTP signature format (~httpsig@1.0) and ANS-104 codecs.\n\nIII. Legacynet vs. Mainnet: What’s the difference?\nTo understand why this upgrade matters, it’s essential to distinguish between the two:\n\nLegacynet: AO’s original testnet, designed for experimentation and early deployments before AO-Core launched. While functional, it had limitations in scalability and execution speed due to its reliance on free compute nodes provided by Forward Research. Other organizations, such as AR.IO, also ran their own compute nodes to support infrastructure built on Arweave and AO.\nMainnet (AO-Core): The production-ready, high-performance version of the AO protocol, built with a modular structure that allows multiple computational models to interact while ensuring state integrity, verifiability, and decentralization on Arweave. HyperBEAM serves as the client implementation for AO-Core, allowing developers to run their own nodes and provide services within the network, abstracting hardware provisioning from execution.\n\nWith the latest preview update to HyperBEAM, AO-Core is now approaching Milestone 3. A key point to note: AO processes themselves do not “live” on either AO mainnet or legacynet, they are simply data stored on Arweave. This update demonstrates that those processes can now be executed seamlessly on mainnet.\nIV. AO milestones\nThis update is a major step in the transition from legacynet to mainnet. Here’s how it fits into AO’s roadmap:\nMilestone 1 (Released February 9)\n\nAO-Core reached candidate-level stability, establishing its foundational infrastructure.\nIntroduced payment devices, allowing users to pay operators for prioritized computation.\nDeveloper tools like AOS and aoconnect integrated payment functionality.\n\n\nMilestone 2\n\nIntroduced a preview version of HyperBEAM’s full-stack devices, enabling AO processes to run natively inside HyperBEAM.\nAdded TEE-secured execution, improving security and verifiability.\nWatch the full HyperBEAM demo here.\n\n\nMilestone 3\n\nLegacynet processes are now compatible with AO-Core, enabling applications built on testnet to run on HyperBEAM without code changes.\nThis allows the community to migrate applications from the free legacynet compute cluster to HyperBEAM AO-Core nodes.\nDexi is already testing the first migration to HyperBEAM, with more applications on the way.\n\nLearn more about the AO release nomenclature here.\nV. Why this matters\nFree compute equals slow compute. Anyone who has used legacynet applications has likely experienced delays, as demand often outstrips available resources. When AO mainnet launched, many expected immediate performance improvements. However, legacynet compute clusters provided by Forward Research remained in operation because:\n\n\nThe network’s stability needed to be tested before applications could migrate.\n\n\nNew node operators needed to onboard to HyperBEAM for distributed computation.\n\n\nNow, with Milestone 3, legacynet processes can run on HyperBEAM and this transition is happening without downtime. This is possible because both networks use the same data structures stored on Arweave. Developers won’t need to create new processes for mainnet; instead, existing legacynet processes can now be executed on HyperBEAM.\nA significant improvement that developers are celebrating is that HyperBEAM now offers full HTTP APIs for AO processes, without dry-runs. Previously, developers had to simulate executions of messages on processes. With this update, HyperBEAM allows direct data calls from external sources, drastically improving performance for developers and users alike.\nWhile AO-Core is already stable, HyperBEAM still requires large-scale testing before reaching candidate release status. The current system is functional but not yet fully optimized for speed, with legacynet interactions still taking ~3 seconds per message. Future updates will focus on performance improvements and additional migration tools.\nVI. What’s next?\nWith this major milestone reached, AO’s next focus will be on onboarding more applications to HyperBEAM nodes. The team is actively working on scaling to support the millions of processes currently running on legacynet.\nThis Saturday Update marks a critical step toward interoperability within AO’s infrastructure. We’re excited to see how developers take advantage of this upgrade as we move toward full HyperBEAM deployment. Stay tuned for more updates!\nFurther reading\n\nAO mainnet is live\nAO nomenclature explained\nHow message passing work on AO\n\nResources\nAO\n\nWebsite\nX\nMirror\n"},"article/legacynet-mainnet-transition":{"title":"The transition from AO legacynet to mainnet: What builders and users need to know","links":["article/ao-nomenclature","explore","article/hyperbeam-milestone-3","article/ao-mainnet-live","article/ao-message-passing-explained"],"tags":[],"content":"\nI. Introduction\nThe recent HyperBEAM Milestone 3 PR marks an important technical update to allow the transition from legacynet to mainnet by enabling legacynet processes to execute on HyperBEAM. Since data on both legacynet and mainnet is stored on Arweave, both networks can execute the same data. This shift will significantly improve AO’s scalability and efficiency. This post explains why the transition matters, the current state of HyperBEAM, and how both developers and users can prepare.\nII. Why it’s time to migrate to HyperBEAM\nCurrently, most apps in the ecosystem rely on the free compute cluster due to its accessibility and high rate limits. However, this centralized dependency creates bottlenecks. When the free cluster is overwhelmed, users may perceive AO as being “down,” when in reality, resources are simply limited on one subset of nodes. Users can always run their own AO nodes to avoid these issues.\nARIO, a key infrastructure provider in the ecosystem, has taken this approach by running its own compute units (CUs) on legacynet to support traffic to its processes. ARIO engineer DTF explains this in detail in this thread.\nWith HyperBEAM Milestone 3, developers can now connect their legacynet processes to HyperBEAM and access mainnet compute, offering a truly decentralized and scalable alternative that is no longer reliant on a few free compute nodes provided by ecosystem teams.\nIII. Current state of HyperBEAM\nMilestone 3 is feature-complete but still requires optimization. The preview status means that while some refinements are needed, it is live and ready for deployment in non-value-sensitive staging environments.\nThis version of HyperBEAM allows developers to write data to legacynet scheduled processes and compute their outputs. However, it should not yet be relied upon for 100% accuracy until further testing and validation are completed.\nKey highlights of milestone 3:\n\nScheduler Compatibility: GET and POST requests to AO legacynet schedulers via ~scheduler@1.0, enabling seamless execution on HyperBEAM.\nTEE-Based Compute: ~green-zone@1.0 supports trusted execution environments (TEE) for secure, decentralized computation.\nOptimized Performance: Enhanced message encoding efficiency and ANS-104 tag normalization for smoother processing.\nJSON &amp; Arweave Integration: AO-Core messages can be requested in specific codecs, and HyperBEAM nodes can serve Arweave data directly to browsers.\n\nIV. AO key milestones\nAO-Core is designed with modularity in mind. Think of it as a decentralized supercomputer where different “devices” can be plugged in for various computing tasks. This gives node operators flexibility over the services they offer to users. The development of HyperBEAM is happening in key milestones:\n\nMilestone 1: Launched on February 8, introducing AO-Core with support for paid compute services.\nMilestone 2: Added native execution devices, including schedulers, messaging systems, compute engines, and TEE (Trusted Execution Environment) support.\nMilestone 3: Made HyperBEAM nodes fully compatible with existing Legacynet processes, allowing a smooth transition from free compute nodes to a decentralized, scalable network.\n\nLearn more about the AO release nomenclature here.\nV. How developers can prepare\nAs mentioned earlier, Milestone 3 is feature-complete but still requires optimization. Developers can begin writing data to legacynet scheduled processes and computing their outputs on HyperBEAM.\nTo get started, developers can spin up HyperBEAM nodes. More details can be found in the HyperBEAM GitHub documentation.\n\nJoin the HyperBEAM node operator Discord here\n\nApp developers can process payments on AO-Core through AOS. More details can be found in the AO Cookbook guide.\n\nJoin the main AO Discord here\n\nVI. How users can prepare\nPermaweb applications will soon begin migrating to HyperBEAM. DeFi platforms such as Botega and Permaswap, both of which have experienced the most severe Legacynet traffic bottlenecks, are prioritizing HyperBEAM integration as soon as possible. Follow their announcements for updates on their migration progress.\nFor broader ecosystem updates, the best sources are the official AO account on Xand Sam’s X account. The team is actively working to make this transition seamless, so keep an eye out for further developments and be ready to test the next iteration of the hyper-parallel computer.\nSee the full ecosystem in our permaweb Explore.\nVII. Conclusion\nAO is moving toward a more decentralized future with HyperBEAM. While free compute has been a great on-ramp, transitioning to mainnet ensures sustainable growth and stability. Users should begin preparing by testing applications and staying informed on official updates.\nAO is not like other blockchains. It presents a new approach to decentralized compute, and getting the core functionality right now is crucial and far better than trying to fix fundamental issues after the system is fully in place.\nFurther reading\n\nLegacynet SU compatibility\nAO mainnet is live\nAO nomenclature explained\nHow message passing work on AO\n\nResources\nAO\n\nWebsite\nX\nMirror\n"},"article/permaweb-index-takeaways":{"title":"Permaweb Index is live: Key takeaways","links":["article/permaweb-index","article/ao-yield"],"tags":[],"content":"\nI. Introduction\nThe Permaweb Index went live on Pi Day (3.14), introducing a new method for users to allocate their AO yield to ecosystem projects in exchange for the project tokens. Here are the key takeaways from the launch.\nFirst, what is the Permaweb Index?\nThe Permaweb Index is a decentralized funding mechanism that allows users to allocate AO yield to projects on the permaweb in exchange for PI tokens. Unlike traditional VC funding or token presales, this model ensures that projects receive ongoing support from the community, rather than relying on one-time investments.\nThe Permaweb Index is a new funding mechanism that provides fair opportunities for the community to support projects while enabling builders to secure development funding. The PI token acts as a default means of exchange on the permaweb, offering broad exposure to the entire ecosystem without requiring active management. PI represents ownership of core permaweb assets:\n\n33.3% $AR\n33.3% $AO\n33.3% Fair launch ecosystem projects\n\n\nII. Directly support projects in the Permaweb Index\nUsers can now be early supporters of Permaweb Index projects by allocating AO yield either to PI itself or directly to specific projects they believe in. The allocated yield funds development for these applications, and in return, users receive project tokens.\nThis creates a fair funding environment and gives the community a stake in the projects they use everyday.\nIII. PI as a means of exchange\nDuring the Pi Day X Space, Sam Williams discussed the idea that PI could evolve into a means of exchange on the permaweb, though he emphasized that the market will ultimately decide. This could introduce a new dynamic, as PI consists of 1/3 AR, 1/3 AO, and 1/3 ecosystem fair launch projects, giving holders exposure to the full stack of permaweb infrastructure, including its core applications.\nPI could also serve as an indicator of the ecosystem’s health, much like how the S&amp;P 500 reflects the state of the U.S. economy. Because PI combines three interconnected yet different degrees of volatility assets, its value might provide insight into the strength and growth of the ecosystem.\nIf PI becomes a widely used medium of exchange on the permaweb, it would represent a shift from how most blockchain ecosystems function today since most use the core token as the means of exchange.\nIV. PI as a reputation system\nThe Permaweb Index doesn’t just offer developers a new way to fund their projects, it also introduces a reputation system for projects in the ecosystem.\nAny project can launch a fair token, but the amount of yield allocated by users serves as a signal of trust. High-quality projects will attract more yield, while weaker ones will struggle to gain traction.\nSince PI automatically rebalances based on project allocations, low-value projects will naturally make up a smaller share of the index over time. This dynamic helps filter out lower-quality projects and creates a more accurate representation of the ecosystem.\nThat said, bad actors will always exist in any permissionless system. PI makes it harder for projects to rug-pull their communities, but as always, do your own research before investing in any project.\nV. Conclusion\nThe Permaweb Index introduces a novel way to fund projects, signal reputation, and possibly even serve as a means of exchange. It’s still early, but the way users engage with PI will shape how it evolves in the ecosystem.\nStay tuned for more info on the full launch of Permaweb Index Fair Launch Creator. Soon all projects will be able to permissionlessly launch projects, but for now the team is testing the security and stability of the early release.\nFurther reading\n\nPI Day 2025: The Permaweb Index Goes Live – Everything You Need to Know\nHow to allocate AO yield in the Permaweb Index\nAutonomous Finance - Permaweb Index (PI) Token Goes Live on Pi Day: A New Era for Fair Launch Support\n\nResources\nAO\n\nWebsite\nX\nMirror\n\nAutonomous Finance\n\nWebsite\nX\n\nPermaweb Index Projects\n\nApus Network\nar.io\nBasejump\nBazar\nBotega\nProtocol.Land\n"},"article/permaweb-index":{"title":"PI Day 2025: The Permaweb Index Goes Live – Everything You Need to Know","links":[],"tags":[],"content":"\nI. Introduction\nThe Permaweb Index (PI) token goes live on Pi Day (3.14), marking a major shift in how crypto projects can be funded. Traditionally, venture capital firms and angel investors have had an unfair advantage, acquiring discounted tokens before public availability. These insiders often sell their holdings at price peaks, “dumping” on retail investors and creating volatility and downside risk.\nII. What is the Permaweb Index?\n\nThe Permaweb Index introduces a new mechanism that provides fair opportunities for the community to support projects while enabling builders to secure development funding. The PI token acts as a default means of exchange on the permaweb, offering broad exposure to the entire ecosystem without requiring active management. PI represents ownership of key permaweb assets:\n\n33.3% $AR\n33.3% $AO\n33.3% Fair launch projects\n\nHow do builders benefit from the Permaweb Index?\nDevelopers can fund their projects through support from the ecosystem, the people who actually use their platforms, rather than relying on venture capital. Founding teams have full control over how they allocate the yield earned from PI. This allows them to use their yield to fund development and reward users if they choose.\nHow do permaweb users benefit from the Permaweb Index?\nUsers support core Permaweb infrastructure (AR, AO) while maintaining control over which ecosystem projects they back. On the AO Mint page, users can decide how much of their PI they want to allocate to specific projects. This creates diversification and flexibility. There are no vesting periods or lockups, so allocations can be withdrawn at any time.\nIII. Why Fair Launch over VC funding?\nBuilding a blockchain-based project is capital-intensive. Early funding supports technical development, business growth, and go-to-market efforts. While venture capital may seem like the easier route, it often leads to long-term challenges.\nOne common complaint in crypto is projects “dumping on retail” after their ICOs. This happens because early investors acquire tokens at a steep discount, sometimes just a fraction of the public price. These insiders often have a token lock-up period, a set duration where they are restricted from selling their tokens. While lockups prevent immediate sell-offs, they create artificial scarcity that inflates token prices. Once the lockup expires, VCs and insiders can sell their holdings, crashing the market and leaving retail investors at a loss.\nThis is why the AO token took a different approach: a fair launch with no insider allocations or vesting periods. Funding comes from users staking their yield-bearing assets (stETH, DAI) into the ecosystem. More details on AO tokenomics can be found here.\n\nThe VC funding model for crypto projects is no longer sustainable. Token lock-ups artificially drive up prices, making tokens appear more valuable than they actually are. When insiders cash out, retail investors are left holding the bag, leading to distrust and discouraging real adoption.\nA fair launch model ensures that funding flows directly to builders while giving users and retail investors a fair chance to support projects they actually use.\nIV. Which projects are in the Permaweb Index?\n\nThe first set of projects participating in the fair launch is listed below, with more details on how to participate coming soon.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProjectDescriptionApus NetworkDecentralized AI platform utilizing AO and Arweave for deterministic GPU computing.ar.ioThe first permanent cloud network providing data storage and web hosting.BasejumpScalable, permissionless AI gaming substrate.BazarDigital content marketplace built on AO’s Universal Content Marketplace (UCM), a decentralized order book for creators.BotegaAI-powered DEX leveraging autonomous agents for optimized liquidity and advanced order execution.Protocol.LandDecentralized source control platform for building and deploying applications and protocols.\nV. How the Permaweb Index rolls out\nAs announced by Autonomous Finance, the Permaweb Index will launch in phases. The PI token will go live on 3.14, but the ability to create new fair launch projects will follow soon after. The primary focus is on network stability and security, as multiple moving parts must work together to make the Permaweb Index possible. The team will provide more details on the fair launch process for adding new projects to the index.\nVI. Conclusion\nThe launch of the Permaweb Index represents a fundamental shift in how crypto projects are funded, moving away from VC dominance and toward a community-driven, fair launch model. This approach empowers builders and users alike, ensuring sustainable growth for the permaweb ecosystem.\nResources\nAO\n\nWebsite\nX\nMirror\n\nAutonomous Finance\n\nWebsite\nX\n\nPermaweb Index Projects\n\nApus Network\nar.io\nBasejump\nBazar\nBotega\nProtocol.Land\n\n\nThis article is not financial advice. Please do your own research."},"article/pixl-fair-launch":{"title":"Bazar's PIXL fair launch token","links":["reference/ucm","article/ao-yield","projects/bazar"],"tags":[],"content":"\nPIXL has been the rewards token of the Universal Content Marketplace (UCM) and used in Bazarfor the past year and a half, distributed strictly through user engagement incentives. Now, with 15,531,330.5888 PIXL already minted, the remaining supply is being reallocated: 75% for the Permaweb Index (PI) Fair Launch and 25% for ongoing daily engagement rewards.\nI. PIXL tokenomics\n\nMax Supply: 26 million units.\nMinting Model: Bitcoin-like halving schedule.\nDistribution:\n\n75% allocated to the PI Fair Launch.\n25% reserved for continued engagement rewards.\n\n\n\nThis ensures a fair distribution while keeping incentives aligned with long-term participation in the ecosystem.\nII.Fair launch allocation breakdown\n\nAt block 1,628,189, the total circulating supply was 15,531,330.5888 PIXL. Using the fair launch allocation formula:\n\nFAIR_LAUNCH_SUPPLY = (Max Supply - Current Minted) * 0.75\nFair Launch Allocation: 8,061,502.0584 PIXL\nRemaining for Daily Rewards: 2,687,167.3528 PIXL\n\nThis gradual release balances long-term incentive structures with the fair launch distribution.\nIII. Daily engagement rewards breakdown\n\nPIXL is distributed to users who engage with atomic asset purchases on UCM platforms like Bazar. Buying streaks determine a user’s reward share:\n\nStreaks: Consecutive days of purchasing atomic assets increase a user’s PIXL share.\nWeight system: Rewards start at a base weight of 1 and increase by 0.1 per day, up to a max weight of 4 at 30 days.\nReset mechanism: After 30 days, streak weight resets to 1, ensuring continuous participation.\n\nPIXL launched on August 2, 2023, at block height 1,232,228. It follows a daily minting cycle with a halving mechanism, ensuring a gradual and predictable token distribution. Now that the remaining daily rewards allocation is 2,687,167.3528 PIXL, this is the updated yearly rewards distribution.\n\nYear 1: 7,360 PIXL per day\nYear 2: 3,680 PIXL per day\nYear 3: 1,840 PIXL per day\nYear 4: 920 PIXL per day\nYear 5: 460 PIXL per day\n\nThis structured emission model incentivizes consistent user engagement while aligning with the long-term sustainability of the ecosystem.\nPIXL burn mechanism\nTo ensure long-term sustainability and scarcity:\n\nA 0.5% UCM fee is collected (Bazar itself takes no fees).\nIf transactions involve wAR, fees are used to buy PIXL from available orders.\nThe purchased PIXL is burned, reducing supply over time.\n\nHigher trading volumes lead to increased buy pressure and more PIXL burned, aligning incentives for active participation.\nIV. How to allocate AO yield to ecosystem projects\nBazar is one of six ecosystem projects participating in the Permaweb Index, with more to be added soon. To allocate AO yield to earn PIXL and other ecosystem project tokens:\n\nVisit AO Mint.\nChoose the fair launch projects to allocate yield to.\nAdjust allocation under “Details &amp; Add.”\nSave changes.\n\nMore details on AO yield delegation are available here.\n\nV. Conclusion\nWith its Bitcoin-like halving model and streak-based reward system, PIXL continues to incentivize meaningful engagement with atomic assets, reinforcing the decentralized marketplace’s growth. As AO yield allocation expands and new projects join the Permaweb Index, PIXL remains a core asset driving network activity and value accrual.\nFor those looking to participate, now is the time to engage, earn, and contribute to the evolution of the decentralized content economy.\nResources\n\nBazar\n\nAO\n\nWebsite\nX\nMirror\n\n\nThis is not financial advice. Please do your own research."},"article/storage-endowment-explained":{"title":"How Arweave’s storage endowment ensures permanent data storage","links":["reference/arweave","reference/storage-endowment"],"tags":[],"content":"\nI. Introduction\nWhen you store data on Arweave, you’re not just making a one-time payment for storage you’re contributing to a long-term storage endowment. This mechanism operates similarly to a “buyback and burn” model, ensuring data permanence through a unique economic design. Here’s how it works:\n\nUpfront Payment: Users pay for 200 years of storage at current prices when they upload data.\nEndowment Fund: These payments are pooled into a decentralized storage endowment, which compensates miners over time for maintaining data.\nToken Supply Reduction: The tokens in the endowment are effectively removed from circulation unless they need to be reissued to cover storage costs in the future.\n\nSince Arweave’s launch nearly seven years ago, not a single token has been reissued from the endowment. This means the token supply continues to shrink as usage increases, reinforcing the economic sustainability of the network.\nII. The power of declining storage costs\n\nThe key to Arweave’s long term storage is the historical trend of declining storage costs, a principle known as Kryder’s law. Over the past 50 years, storage costs have decreased by an average of 38% per year. If this trend continues, the purchasing power of the endowment will grow faster than the storage costs it needs to cover, ensuring the network never runs out of funds.\n\nIf storage costs never decline again, the last token used for today’s storage would be reissued in 200 years.\nIf storage costs decline at just 0.5% per year, the endowment would never run out of funds.\nAt historical decline rates (~38% per year), the vast majority of tokens will never need to be reissued, permanently reducing supply.\n\nIII. Why users don’t want “cheap” permanent storage\nUnlike traditional cloud storage, where you pay an ongoing fee, Arweave users pay once for permanent storage. But why is this price set conservatively?\n\nIf storage was too cheap, the endowment might run out of funds, jeopardizing data permanence.\nUsers prioritize reliability over cost, they’re paying for guaranteed permanence, not just low fees.\nThe endowment acts as a risk model, ensuring that stored data remains accessible indefinitely, even in worst-case scenarios.\n\nSee the current cost to store data on Arweave here.\nIV. Arweave is a self-sustaining storage network\nArweave’s approach creates a unique economic advantage. The network becomes more secure as usage increases since more tokens are absorbed into the endowment. And unlike other storage models, Arweave doesn’t rely on external revenue or subsidies as its design naturally sustains itself.\nV. Conclusion\nArweave’s storage endowment is an often misunderstand but cleverly developed aspect of the protocol. By leveraging declining storage costs and a long-term endowment, Arweave provides truly permanent data storage, ensuring that what’s stored today will still be accessible hundreds of years from now.\nFor a deeper dive, including detailed mathematical models and a storage endowment simulator, check out this wiki here.\nArticle is inspired by this tweet.\nFurther reading\n\nArweave\nStorage endowment\n\n\nThis is not financial advice. Please do your own research."},"article/welcome":{"title":"Welcome to the Permaweb Journal","links":["newsletter"],"tags":[],"content":"Welcome to the Permaweb Journal. Permaweb Journal is an onchain publication covering the future of the internet and digital society through journalism, analysis, and technical documentation. It provides in-depth coverage of the Arweave and AO ecosystem.\nThe a\nWe publish a free weekly newsletter, with articles cross-published on our website."},"articles":{"title":"Articles","links":["article/ao-gaming-chain","article/legacynet-mainnet-transition","article/hyperbeam-milestone-3","article/ao-permaweb-guide","article/storage-endowment-explained","article/pixl-fair-launch","article/permaweb-index-takeaways","article/ao-yield","article","article/permaweb-index","news/introducing-permaweb-journal","article/ao-nomenclature","article/ao-mainnet-live","article/ao-message-passing-explained"],"tags":[],"content":"Coverage of the permaweb ecosystem. Technical deep dives, project updates, op-eds and media features all live here.\n\nLatest Articles\n\n\nAO is shaping up to become a gaming chain\nMarch 26, 2025\nGaming on AO is one of the most exciting areas to watch. This post explores why AO is positioned to become a leading gaming chain.\n\n\n\n\n\n\n\nThe transition from AO legacynet to mainnet: What builders and users need to know\nMarch 25, 2025\nThis post explains why the transition from legacynet to mainnet matters, the current state of HyperBEAM, and how both developers and users can prepare.\n\n\n\n\n\n\n\nLegacynet SU compatibility: What this latest update means for HyperBEAM\nMarch 24, 2025\nAO-Core just hit a major milestone: legacynet processes can now execute on HyperBEAM. This update brings seamless interoperability, improved performance, and a smoother transition from testnet to mainnet. Learn what this means for developers and the future of AO.\n\n\n\n\n\n\n\nThe role of AO in the permaweb ecosystem - A beginner’s guide\nMarch 20, 2025\nThe permaweb is a permanent, decentralized web built on Arweave, and AO provides the computational layer to power its next evolution. Learn how AO and HyperBeam enables decentralized applications, sustainable funding, and a new paradigm for the web.\n\n\n\n\n\n\n\nHow Arweave’s storage endowment ensures permanent data storage\nMarch 19, 2025\nSince Arweave’s launch nearly seven years ago, not a single token has been reissued from the endowment. This means the token supply continues to shrink as usage increases. Learn more about the storage endowment in this article\n\n\n\n\n\n\n\n\n\nBazar&#039;s PIXL fair launch token\nMarch 18, 2025\nThe PIXL Fair Launch is here. Learn all about the PIXL fair launch allocation and how to earn PIXL rewards for purchasing digital content on the Universal Content Marketplace protocol.\n\n\n\n\n\n\n\nPermaweb Index is live: Key takeaways\nMarch 17, 2025\nThe Permaweb Index went live on Pi Day (3.14), introducing a new method for users to allocate their AO yield to ecosystem projects in exchange for the project tokens. Here are the key takeaways from the launch.\n\n\n\n\n\n\n\nHow to allocate AO yield in the Permaweb Index\nMarch 13, 2025\nThe Permaweb Index launches on 3.14 (Pi Day), introducing a new model for funding crypto projects.This guide explains how to allocate AO yield step by step.\n\n\n\n\n\n\n\nPI Day 2025: The Permaweb Index goes live - Everything you need to know\nMarch 12, 2025\nThe Permaweb Index (PI) launches on Pi Day 2025, introducing a fair launch model for funding permaweb projects. Learn how PI works and how to get involved.\n\n\n\n\n\n\n\nIntroducing Permaweb Journal\nMarch 10, 2025\nIntroducing Permweb Journal, an onchain publication and knowledge hub dedicated to covering the future of the internet and digital society built on Arweave and AO.\n\n\n\n\n\n\n\nAO nomenclature explained\nFebruary 27, 2025\nAO mainnet is live, but what does that mean? This blog breaks down the AO software release phases, key milestones like AO-Core and HyperBEAM, and what’s next for the permaweb.\n\n\n\n\n\n\n\nAO mainnet is live\nFebruary 10, 2025\nAO mainnet is live. Learn more about the new AO-Core protocol, the latest on the AO token, and the launch of the Permaweb Index (PI).\n\n\n\n\n\n\n\nHow message passing works on AO\nJanuary 24, 2025\nLearn how AO’s parallel message passing system removes bottlenecks and scales processes for better efficiency on the permaweb.\n\n\n\n\n\n\nMedia Coverage\n2025\n\n[Feb 8] Arweave’s computing platform AO goes live on mainnet - The Block\n[Jan 27] Arweave 2.9 Upgrade Introduces Breakthrough Data Preparation Algorithm - BusinessWire\n[Jan 15] Arweave loads data onto lunar lander headed to the moon, meant to last for thousands of years - The Block\n\n2024\n\n[Nov 14] Arweave 2.8: A Major Upgrade for the Permaweb - BusinessWire\n[April 12] Community Labs Launches $35M AO Ventures Incubator Program for Arweave Ecosystem- Yahoo Finance\n[Feb 27] Arweave launches public testnet for ‘hyper parallel’ AO protocol - Crypto Briefing\n"},"explore":{"title":"Explore","links":["projects/ao-acc","projects/community-labs","projects/ever-vision","projects/forward-research","projects/longview-labs","projects/0rbit","projects/anyone-protocol","projects/ar-io","projects/autonomous-finance","projects/everpay","projects/fusionfi","projects/load-network","projects/redstone","projects/aox","projects/quantum","projects/ao-ventures","projects/arweave-scp","projects/hansa","projects/permanent-ventures","projects/sevenx-ventures","projects/bazar"],"tags":[],"content":"Evolving list of projects in the permaweb ecosystem.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCategoryProjectLabs- ao-acc Labs- Community Labs- everVision- Forward Research- Longview LabsInfrastructure- 0rbit- ANyONe Protocol- ar.io- Autonomous Finance- everPay- FusionFi Protocol- Load Network- RedstoneBridge- AOX- QuantumInvestment- ao Ventures- Arweave SCP Ventures- Hansa- Permanent Ventures- SevenX VenturesWallet- Beacon Wallet (X)- Keystone Hardware Wallet (X)- Othent (X)- Wander (X)Community- ao computer club (X)- Developer DAO (X)- Only Arweave (X)- PermaDAO (X)- Weavers (X)DeFi- aolotto (X)- aoVest (X- Astro (X)- Botega- Coinburn- Convergent (X)- Dexi- FusionFi Protocol(X)- LiquidOps (X)- Outcøme (X)- Permaswap (X)- Perplex (X)- Veritas (X)AI- Apus Network (X)- Autonomous Finance (X)- DataOS (X)- FusionFi Protocol(X)Block explorer- AOLink- ViewBlock (X)Developer tools- aoDevbot- BetterIDEa (X)- CosmWasm (X)- Liteseed (X)- Protocol.Land (X)- Sentio (X)Gaming- AO Games (X)- Basejump (X)- Dumverse (X)- Llama Land (X)- Meka City (X)- Permaverse (X)- Satoshi’s Palace (X)- Stargrid Battle TacticsCreator economy- Atomic Notes (X)- Bazar- Copus (X)- DecentraMind- LOOM (X)- Onairos (X)- Odysee (X)- Solarplex (X)- TYPR (X)NFT- AO Hoodrats (X)- Dumdumz (X)- Meka Human (X)                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      "},"index":{"title":"Permaweb | Journal","links":["articles","explore","learn","article/ao-gaming-chain","article/legacynet-mainnet-transition","article/hyperbeam-milestone-3","article/ao-permaweb-guide","article/storage-endowment-explained","article/pixl-fair-launch","article/permaweb-index-takeaways","article/ao-yield","article/permaweb-index","news/introducing-permaweb-journal","article/ao-nomenclature","article/ao-mainnet-live","article/ao-message-passing-explained"],"tags":[],"content":"Permaweb Journal is an onchain publication and knowledge hub exploring the future of the internet and digital society built on Arweave and AO. Discover the permaweb through in-depth articles, ecosystem projects, and technical resources.\n\nLatest Articles\n\n\nAO is shaping up to become a gaming chain\nMarch 26, 2025\nGaming on AO is one of the most exciting areas to watch. This post explores why AO is positioned to become a leading gaming chain.\n\n\n\n\n\n\n\nThe transition from AO legacynet to mainnet: What builders and users need to know\nMarch 25, 2025\nThis post explains why the transition from legacynet to mainnet matters, the current state of HyperBEAM, and how both developers and users can prepare.\n\n\n\n\n\n\n\nLegacynet SU compatibility: What this latest update means for HyperBEAM\nMarch 24, 2025\nAO-Core just hit a major milestone: legacynet processes can now execute on HyperBEAM. This update brings seamless interoperability, improved performance, and a smoother transition from testnet to mainnet. Learn what this means for developers and the future of AO.\n\n\n\n\n\n\n\nThe role of AO in the permaweb ecosystem - A beginner’s guide\nMarch 20, 2025\nThe permaweb is a permanent, decentralized web built on Arweave, and AO provides the computational layer to power its next evolution. Learn how AO and HyperBeam enables decentralized applications, sustainable funding, and a new paradigm for the web.\n\n\n\n\n\n\n\n\n\nHow Arweave’s storage endowment ensures permanent data storage\nMarch 19, 2025\nSince Arweave’s launch nearly seven years ago, not a single token has been reissued from the endowment. This means the token supply continues to shrink as usage increases. Learn more about the storage endowment in this article\n\n\n\n\n\n\n\nBazar&#039;s PIXL fair launch token\nMarch 18, 2025\nThe PIXL Fair Launch is here. Learn all about the PIXL fair launch allocation and how to earn PIXL rewards for purchasing digital content on the Universal Content Marketplace protocol.\n\n\n\n\n\n\n\nPermaweb Index is live: Key takeaways\nMarch 17, 2025\nThe Permaweb Index went live on Pi Day (3.14), introducing a new method for users to allocate their AO yield to ecosystem projects in exchange for the project tokens. Here are the key takeaways from the launch.\n\n\n\n\n\n\n\nHow to allocate AO yield in the Permaweb Index\nMarch 13, 2025\nThe Permaweb Index launches on 3.14 (Pi Day), introducing a new model for funding crypto projects.This guide explains how to allocate AO yield step by step.\n\n\n\n\n\n\n\nPI Day 2025: The Permaweb Index goes live - Everything you need to know\nMarch 12, 2025\nThe Permaweb Index (PI) launches on Pi Day 2025, introducing a fair launch model for funding permaweb projects. Learn how PI works and how to get involved.\n\n\n\n\n\n\n\nIntroducing Permaweb Journal\nMarch 10, 2025\nIntroducing Permweb Journal, an onchain publication and knowledge hub dedicated to covering the future of the internet and digital society built on Arweave and AO.\n\n\n\n\n\n\n  \n    AO nomenclature explained\n    February 27, 2025\n    AO mainnet is live, but what does that mean? This blog breaks down the AO software release phases, key milestones like AO-Core and HyperBEAM, and what’s next for the permaweb.\n  \n  \n    \n  \n\n\n  \n    AO mainnet is live\n    February 10, 2025\n    AO mainnet is live. Learn more about the new AO-Core protocol, the latest on the AO token, and the launch of the Permaweb Index (PI).\n  \n  \n    \n  \n\n\n  \n    How message passing works on AO\n    January 24, 2025\n    Learn how AO’s parallel message passing system removes bottlenecks and scales processes for better efficiency on the permaweb.\n  \n  \n    \n  \n\n\nGet Involved\n\nBecome a member by subscribing to the newsletter to stay up to date on the permaweb and be the first to know about future community initiatives.\nSubmit a guest post- Contact Alex if you’re interested in contributing to the journal.\n"},"learn":{"title":"Learn","links":["reference/arweave","reference/ao","reference/permaweb"],"tags":[],"content":"The permaweb is a decentralized web ecosystem that uses Arweave’s permanent data storage capabilities with the hyper parallel compute power of AO. Together Arweave and AO make up the permaweb, a new internet that doesn’t forget.\nLearn more about Arweave and AO in these permaweb learning guides.\n\nArweave 101\nAO 101\nPermaweb\n\n\n\n\nMore resources\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCategoryResourcesDocumentation- AO Cookbook- Permaweb Cookbook- Arweave Docs- Specs- ar.io -Autonomous Finance - FusionFi Protocol -HyperBEAMVideo Resources- AO- Permaweb- Community Labs- Weavers- Arweave India- Arweave New York- ar.io- ao/acc- Autonomous FinanceBlogs- Arweave Today- Community Labs- Open Access Supercomputing Foundation- PermaDAO- Weavers\n"},"news/introducing-permaweb-journal":{"title":"Introducing Permaweb Journal","links":[],"tags":[],"content":"\nWith rapid advancements in computing and AI, humanity’s acceleration into cyberspace is inevitable. But what does that mean for our online spaces, our physical spaces, and what it means to be human?\nMost of our digital world is controlled by a handful of tech oligopolies, where governments and corporations surveil without permission and algorithms shape perception of reality. We face a choice: accept an internet dictated by a select few, one that rewrites history, fosters division, and leaves us unfulfilled, or consciously build a new web from the ground up.\nArweave grants the right to remember in a world that forgets. AO grants the right to boundless computing in a world constrained by centralization. Together, they form the permaweb, a freer internet that safeguards the right to speech and access to information, ensuring the world’s knowledge is permanently secure.\nI’m excited to soft launch The Permaweb Journal, an online publication and knowledge hub dedicated to covering the Arweave and AO ecosystem. This journal will track the latest developments in the space and provide a starting point for those looking to learn more.\nIt’s time to build the new web.\n\nOriginally published here: paragraph.xyz/@permaweb-journal/introducing-permaweb-journal-1"},"newsletter":{"title":"Newsletter","links":[],"tags":[],"content":"Subscribe to Permaweb Journal Newsletter to get the latest on Arweave, AO, and the evolving permaweb ecosystem, straight to your inbox.\nWhat to expect:\n\nEcosystem Insights – Key updates on AO, Arweave, and emerging projects.\nDeveloper Highlights – New tools, technical deep dives, and builder spotlights.\nEarly Access – Be the first to hear about community initiatives and collaborations.\n\nJoin a network of builders, creators, and thinkers shaping the future of the web.\n\n"},"projects/0rbit":{"title":"0rbit","links":[],"tags":[],"content":"0rbit is the Decentralized Oracle Network built on AO to provide access to LIMITLESS DATA on any AO process.\nOfficial Links\n\nWebsite\nX\nDiscord\nGithub\nYoutube\n"},"projects/anyone-protocol":{"title":"Anyone Protocol","links":[],"tags":[],"content":"The Anyone Protocol is the essential DePIN infrastructure that enables anyone to enjoy seamless privacy and data control, supported by on-chain incentives and signature hardware.\nOfficial Links\n\nWebsite\nX\nDiscord\nGithub\n"},"projects/ao-acc":{"title":"ao/acc Labs","links":[],"tags":[],"content":"ao/acc Labs is dedicated to the mission of helping bring about a truly decentralized web. Harnessing the power of Arweave’s decentralized data storage and ao’s unbounded compute, ao/acc Labs introduces a suite of open-source decentralized apps built on top of them to help usher in a new era of decentralized innovation and collaboration, which has already begun.\nProjects: ArFleet\nOfficial Links\n\nWebsite\nX\nDiscord\nGithub\n"},"projects/ao-ventures":{"title":"AO Ventures","links":[],"tags":[],"content":"AO and Arweave incubator and venture fund.\nOfficial Links\n\nWebsite\nX\nDiscord\nLinkedin\n"},"projects/aox":{"title":"AOX","links":[],"tags":[],"content":"Bridge assets to the AO ecosystem with AOX built by EverVision Labs.\nOfficial Links\n\nWebsite\nX\nTelegram\nDiscord\n"},"projects/ar-io":{"title":"ar.io","links":[],"tags":[],"content":"The AR.IO ecosystem is dedicated to cultivating products and protocols for sustaining access to digital permanence, making the permaweb available to everyone. Powered by the ARIO Token, this global network of Gateways connects users to permanently stored data, files, applications, and web pages on the Arweave decentralized storage network.\nOfficial Links\n\nWebsite\nX\nDiscord\nGithub\nLinkedin\n"},"projects/arweave-scp":{"title":"Arweave SCP","links":[],"tags":[],"content":"The world is rapidly moving towards a decentralized and open web, where information flows freely and is stored permanently. Arweave is leading the way in this transformation with its innovative Storage-based Consensus Paradigm (SCP) that enables on-chain, scalable storage with guaranteed persistence.\nArweave SCP Ventures are committed to identifying and investing in innovative projects that harness SCP consensus to build the next generation of DApps, from social to finance, bringing transparency, security, and scalability to the Web3 era. And this is just the beginning.\nOfficial Links\n\nWebsite\nX\n"},"projects/autonomous-finance":{"title":"Autonomous Finance","links":["article/permaweb-index-takeaways","article/ao-yield","article","article/permaweb-index"],"tags":[],"content":"Autonomous Finance is a dedicated research and technology entity, focusing on the intricacies of financial infrastructure within the ao network.\nOfficial Links\n\nWebsite\nX\nDiscord\nGithub\n\nRelated articles\n\n\nPermaweb Index is live: Key takeaways\nMarch 17, 2025\nThe Permaweb Index went live on Pi Day (3.14), introducing a new method for users to allocate their AO yield to ecosystem projects in exchange for the project tokens. Here are the key takeaways from the launch.\n\n\n\n\n\n\n\nHow to allocate AO yield in the Permaweb Index\nMarch 13, 2025\nThe Permaweb Index launches on 3.14 (Pi Day), introducing a new model for funding crypto projects.This guide explains how to allocate AO yield step by step.\n\n\n\n\n\n\n\nPI Day 2025: The Permaweb Index goes live - Everything you need to know\nMarch 12, 2025\nThe Permaweb Index (PI) launches on Pi Day 2025, introducing a fair launch model for funding permaweb projects. Learn how PI works and how to get involved.\n\n\n\n\n"},"projects/bazar":{"title":"Bazar Marketplace","links":["article/pixl-fair-launch"],"tags":[],"content":"Bazar is a decentralized atomic asset exchange built on the permaweb. Bazar empowers creators and collectors to interact, trade, and transact with digital content of all kinds - images, music, videos, papers, components, and even applications. These guides will help you explore how to use Bazar and why this platform is more than just an NFT marketplace.\nOfficial Links\n\nWebsite\nX\nDiscord\nGithub\n\nRelated articles\n\n\nBazar&#039;s PIXL fair launch token\nMarch 18, 2025\nThe PIXL Fair Launch is here. Learn all about the PIXL fair launch allocation and how to earn PIXL rewards for purchasing digital content on the Universal Content Marketplace protocol.\n\n\n\n\n"},"projects/community-labs":{"title":"Community Labs","links":[],"tags":[],"content":"Community Labs is a venture studio building and bootstrapping permanent data storage on Arweave and AO.\nOfficial Links\n\nWebsite\nX\nDiscord\nLinkedin\nInstagram\nGithub\n"},"projects/ever-vision":{"title":"EverVision","links":[],"tags":[],"content":"EverVision is a software development lab that provides Arweave-based infrastructure for anyone who wants to build on Web3 using everPay, Permaswap and PermaDAO.\nOfficial Links\n\nWebsite\nX\nDiscord\nTelegram\nMedium\nGithub\n"},"projects/everpay":{"title":"EverPay","links":[],"tags":[],"content":"EverPay is a real-time financial protocol for the permaweb. EverPay protocol follows the SCP (Storage-based consensus paradigm), There is no gas fee required, storing all everPay transactions via Arweave.\nOfficial Links\n\nWebsite\nX\nDiscord\nTelegram\nMedium\nGithub\n"},"projects/forward-research":{"title":"Forward Research","links":[],"tags":[],"content":"Forward Research is a leading research and development incubator for the Arweave and AO ecosystem.\nOfficial Links\n\nWebsite\nX\n"},"projects/fusionfi":{"title":"FusionFI Protocol","links":[],"tags":[],"content":"In the field of decentralized finance (DeFi), FusionFi provides a protocol for interoperability in the AgentFi ecosystem. Through this protocol, users can deploy personalized agents the ability to autonomously execute financial operations such as asset management and arbitrage.\nThe core concept of FusionFi is to enable interoperability between agents, allowing them to seamlessly interact across any financial scenario.\nOfficial Links\n\nWebsite\nX\nDiscord\n"},"projects/hansa":{"title":"Hansa","links":[],"tags":[],"content":"Hansa is a private capital investment firm that builds and invests in new ideas to drive progress over the long-term in areas that matter most to free and open societies.\nOfficial Links\n\nWebsite\n"},"projects/load-network":{"title":"Load Network","links":[],"tags":[],"content":"Load Network is the first high performance EVM storage chain. Store, verify, and compute with any data at any scale.\nOfficial Links\n\nWebsite\nX\nDiscord\nTelegram\n"},"projects/longview-labs":{"title":"Longview Labs","links":[],"tags":[],"content":"Longview Labs develops community focused educational content, digital products and community experiences.\nOfficial Links\n\nWebsite\nX\nNewsletter\nYoutube\n"},"projects/permanent-ventures":{"title":"Permanent Ventures","links":[],"tags":[],"content":"Permanent Ventures is a fund focused on investing in decentralized applications which will exist forever.\nOfficial Links\n\nWebsite\nX\n"},"projects/quantum":{"title":"AOX","links":[],"tags":[],"content":"Bridge, trade, earn on AO with USDA and Q Arweave\nOfficial Links\n\nWebsite\nX\nDiscord\nLinkedin\n"},"projects/redstone":{"title":"RedStone Finance","links":[],"tags":[],"content":"Redstone is a blockchain oracle for DeFi and institutions that is available on on 70+ chains, trusted by 130+ clients, supporting 1,250+ assets.\nOfficial Links\n\nWebsite\nX\nDiscord\nGithub\nTelegram\n"},"projects/sevenx-ventures":{"title":"SevenX Ventures","links":[],"tags":[],"content":"A research-driven crypto venture.\nOfficial Links\n\nWebsite\nX\nLinkedin\n"},"reference/ao-core-components":{"title":"AO core components","links":["reference/ao","reference/ao-economics","article/ao-yield"],"tags":[],"content":"Processes\nA process in AO is like a self-contained program that persists indefinitely. Each process maintains a “holographic state” which is a complete record of its activity stored as a log of messages on Arweave. This ensures transparency, auditability, and security.\n→ Technical details about AO processes\nMessages\nEvery interaction in AO whether initiated by a user or another process is represented as a message. These messages:\n\nAdhere to the ANS-104 standard for interoperability.\nAre permanently stored on Arweave for transparency and verification.\nEnable seamless communication between processes without creating bottlenecks.\n\n→ Technical details about AO messages\nMessenger Units (MUs)\nMUs play a vital role in keeping AO’s messaging system running smoothly. They:\n\nRelay messages between processes through a procedure called “cranking.”\nCoordinate message routing and handle recursive interactions efficiently.\nManage subscriptions and schedule tasks, providing flexibility for users and developers.\n\nBy ensuring messages flow seamlessly, MUs help maintain AO’s high-performance communication framework.\nCompute Units (CUs)\nCUs handle the computational workload in AO. When a process needs its state updated or complex calculations performed, CUs step in. They:\n\nCompete in a market to offer efficient computation at the best price.\nDeliver signed attestations of results, ensuring accuracy and trust.\nProvide additional services like verifying other nodes’ computations for a fee.\nCUs ensure AO remains efficient and competitive, even as demand grows.\n\nScheduler Units (SUs)\nScheduler Units oversee the order and integrity of messages in AO processes. When a message is received, SUs:\n\nAssign a unique, incremental nonce to maintain message order.\nSign the message and persist it to Arweave for immutability.\nThis ensures that all interactions remain consistent, secure, and reliable.\n\n→ Technical details about AO Units\nResources\nAO\n\nWebsite\nAO Cookbook\nMirror\nX\n\nFurther reading\n\nAO 101\nAO Tokenomics\nHow to allocate AO yield\n"},"reference/ao-economics":{"title":"Economics of the AO Computer","links":[],"tags":[],"content":"\nThe AO token in 8 key facts and dates:\n\nAO is a 100% fair launch token following Bitcoin’s economic model.\nAO tokens will be used to secure message passing in its network. You can learn more in the new AO paper.\nThe minting mechanism runs retrospectively from 13:00 EST February 27, 2024 (block 1372724). 100% of the AO tokens minted during this period have been granted to Arweave token holders, based on their respective balances held every 5 minutes. If you held AR on exchanges or with a custodian, you should ask them how to receive your tokens.\nGoing forward, a full third (33.3%) of AO tokens will be minted to AR token holders according to their ownership, every 5 minutes. Two thirds (66.6%) of AO will be minted in the future for bridging assets into AO, in order to powerful incentivize economic growth.\nThe first phase of the bridging contracts is live today. During this pre-bridge phase your tokens will remain securely on their native network, while you earn AO tokens. Once phase 2 bridges are live, you will be able to deposit your assets in the new bridge contracts and make use of them on AO – while accruing rewards. You can deposit staked Ethereum (stETH) tokens into the audited pre-bridge contract here.\nBridging rewards start at 11:00 AM EDT June 18, 2024.\nYou can withdraw tokens from the pre-bridge at any time, but you will only start earning AO after rewards begin on June 18. Rewards are distributed once every 24 hours.\nAO tokens will remain locked until ~15% of the supply has been minted. This will occur on approximately February 8th, 2025.\n\nOverview\nAO is a 100% fair launch token modeled after Bitcoin.\nLike Bitcoin, AO has a total supply of 21 million tokens and a similar halving cycle of 4 years, with AO being distributed every 5 minutes, at a monthly rate of 1.425% of the remaining supply. As of June 13, there are 1.0387 million AO in existence. This makes them ultra scarce. For comparison, there are 120 million Ether, 461 million Solana, and 55 billion Ripple tokens.\nAO’s minting mechanism means that although the amount of newly minted tokens halves every 4 years, there is no abrupt “halving event”. Rather, the number of new tokens decreases slightly every month producing a smooth release schedule.\nWhile most token allocations models favor insiders over the community, AO’s model adheres to the principles of fairness and equal access, which are at the core of what the crypto revolution is supposed to be. There are no presales or pre allocations. Instead, the AO token reward mechanism incentivizes two crucial aspects of successful ecosystems: economic growth and the security of its base layer.\nIt works like this:\n~36% (100% of the first 4 months + 33.3% going forward) of AO tokens are minted over time by Arweave token holders, whose tokens incentivize the security of AO’s base layer – Arweave.\n~64% of AO tokens are minted over time for providing external yield and bridging assets into AO to incentivize its economic growth. This creates an extremely strong incentive to grow the liquidity of the ecosystem, leading to an economic flywheel.\nAt the same time, without any token sales, the network provides funding for its own ecosystem development in two ways:\nPermissionless Ecosystem Funding\nAfter bridging is live, developers that attract users who deposit eligible assets in their apps will gain the corresponding AO token rewards. This gives the developers a permissionless, long-term revenue stream without having to apply for grants, external investment — or even necessarily tokenize their projects. These developers can also choose to share part of their AO rewards with their users, if they prefer — allowing users to continue earning AO tokens while using the apps in the ecosystem.\nPermaweb Ecosystem Development Guild\nAdditionally, a number of dedicated ecosystem growth organizations and builders will also split the native yield of assets stored in the bridges. These organizations and builders work on the core protocol of AO, marketing operations, as well as critical infrastructure developments. This funding phases out over time, inline with the decaying rate of the network’s mint — allowing the network to bootstrap, but leaving it as a neutral, shared protocol.\nHow to Check your AO Balance\nThe AO token mint for Arweave token holders has been applied retroactively from the launch of the AO testnet on February 27th 2024 at 12:00AM UTC. Minting AO tokens since the start of the testnet will ensure a sufficient float of tokens before they circulate, targeted to be ~15% of the total supply (3.15 million) on approximately February 8th 2025.\nIf you have been holding $AR over the months since testnet launch, you have accrued approximately 0.016 AO tokens per AR as of June 13, 2024. Keep in mind that the current supply of AO is 1/65th of that of AR.\nMajor exchanges are currently looking into if and how to pass through $AO to their users. Please contact your exchange or custodian to determine how they are administering this process.\nIf you have been self-custodying your $AR tokens, you can easily check your balance by visiting ao.arweave.dev. Click on the Arweave tab and connect your self-custodial wallet (like ArConnect).\n\nEarn AO by Holding AR\nNew AO tokens are minted every 5 minutes. Before the launch of the pre-bridge on June 18th, 100% of all AO tokens were minted by AR token holders. After the launch of the pre-bridge, 33% of AO tokens are allocated and divided proportionately to AR holders, averaging to ~36% of total AO supply minted by AR token holders over time This process happens automatically.\nThe list below shows approximately how many AO you can expect to accrue for a given balance of AR over the next 12 months:\n1 AR: 0.016 AO\n10 AR: 0.16 AO\n50 AR: 0.8 AO\n100 AR: 1.6 AO\n500 AR: 8.0 AO\n1000 AR: 16.0 AO\nThe number of newly minted $AO decreases over time, until all AO tokens are minted. AO tokens will become transferable on approximately February 8th, 2025.\nPre-bridge your stETH To Swap Yield for AO\nNote: AO bridging rewards not available to persons in the US\nDuring this initial period, stETH (ETH staked with Lido) can be deposited to accrue token rewards in AO. Other proof of stake assets will be eligible as we start opening up AO to more ecosystems.\nPre-bridged assets will not be usable in applications on the AO network during this initial period. Once the phase 2 bridge is live, you will be able to use your stETH in AO applications while still accruing AO token rewards.\nWhen pre-bridging your stETH to AO, your original stETH deposit stays in an audited contract on the Ethereum network, while the native yield is split amongst dedicated ecosystem development organizations and builders in the AO ecosystem, in order to fuel growth. Upon launch these organizations are Open Access Supercomputing Foundation, Forward Research, Autonomous Finance, Warp Contracts, Longview Labs, and ao/acc. More organizations will be added as the ecosystem grows.\nYou can withdraw your initial stETH deposit at any time.\nNew AO tokens are minted every 5 minutes after 11 AM EDT June 18, 2024, precisely 16 weeks after the launch of AO’s testnet. After rewards begin, 66% of newly minted $AO are allocated and divided proportionately amongst wallets that pre-bridged to AO. This process happens automatically.\nThe exact number of AO tokens a yield provider receives is determined by the proportion of assets they deposited in the contract relative to the total assets deposited. As AO opens up to more ecosystems and more than one proof of stake asset can be provided, the number of AO tokens received will not only depend on the proportion of assets provided but also on the yield generated by each asset.\nThe list below shows how many AO tokens you can expect to accrue for holding a given percentage of of the total yield bearing asset pool over the next 12 months, assuming the only asset provided is stETH:\n0.01% : 210 AO\n0.1%: 2,105 AO\n0.5%: 10,524 AO\n1%: 21,049 AO\n5%: 105,243 AO\nAO tokens will become transferable on approximately February 8th, 2025.\nHow To Deposit stETH to Accrue AO\nNote: AO bridging rewards not available to persons in the US\nYou can begin depositing stETH into the pre bridge today. Rewards start accruing on June 18, 2024 at 11am EDT. Rewards are distributed once per day, so it may take up to 24 hours before you earn your first rewards.\nFollow these simple instructions to swap your stETH yield for AO tokens:\n\n\nGo to the mint page on the AO website.\nClick on the Ethereum tab and connect your Ethereum wallet (Metamask or Rabby).\nEnter the Arweave wallet address on which you want to receive your AO tokens.\nDeposit stETH into the audited contract by inputting the amount you want to provide. These tokens will stay in the trustless contract on Ethereum and can be withdrawn at any time. If you don’t have stETH in your wallet, you will need to swap other tokens to get some stETH before depositing.\nSign the transaction in your ETH wallet to deposit the stETH in the contract.\nYou will earn AO tokens directly to the Arweave wallet you specified.\n\nSmart contract security\nThe pre-bridge contract has been extensively audited and is trustless: Nobody has access to your tokens apart from you. The only privileged right of any kind is that Open Access Supercomputing Foundation (the organization that has launched AO’s token, in coordination with Arweave ecosystem organizations) is able to eject tokens from the contract – sending them back to their original owners – in the event of a security incident. This functionality offers an additional layer of safety, without putting the pre-bridged assets under the control of any centralized entity.\nThe contracts themselves are a minor modification of the MorpheusAI deposit contracts. These contracts were used in order to provide a battle-tested base, lessening any security risks.\nConclusion\nThe AO token minting process introduces a radically different model that rewards both users and developers, grounded in principles of fairness and equal access. The diverse teams behind this initiative have drawn inspiration from the groundbreaking innovation of Bitcoin and the foundational principles established by Satoshi Nakamoto.\nOver the past fifteen years, the crypto industry has experienced tremendous growth. However, this expansion has not always aligned with broader societal benefits. To truly advance the mission of creating a permissionless and decentralized web that guarantees users’ rights, it became essential to rethink how value and incentives are integrated to achieve these goals. We hope that the principles we advocate resonate with you and may inspire you to join this movement too."},"reference/ao":{"title":"AO 101","links":["reference/ao-core-components","article/hyperbeam-milestone-3","article/ao-message-passing-explained","learn","reference/permaweb","explore","article/permaweb-index","reference/ao-economics","article/ao-yield"],"tags":[],"content":"What is AO?\nAO is a decentralized supercomputer powered by Arweave. AO is known as the “hyper-parallel computer” because it offers decentralized compute without any practical bounds on scale. It combines the reliability of blockchain technology with the efficiency of cloud services, enabling limitless computation and storage without bottlenecks.\nHow does AO work?\nAt the heart of AO is the concept of processes, which are independent programs running on the network. These processes communicate by sending and receiving messages, ensuring a seamless, decentralized computing environment.\nCore components of AO\nAO is powered by several key components that handle storage, computation, and communication:\n\nAO-Core – The foundational protocol that enables processes and message passing.\nHyperBEAM – A high-performance execution engine for running AO processes efficiently.\nMessenger Units (MUs) – Route messages and manage interactions between processes.\nCompute Units (CUs) – Execute computations and verify results.\nScheduler Units (SUs) – Maintain order and integrity of all messages.\n\nFor more detailed information on how these components work together, visit the core components page.\nAO Mainnet vs Legacynet:\nAO is transitioning from its Legacynet test phase into a fully operational mainnet powered by AO-Core and HyperBEAM.\n\nLegacynet: AO’s original testnet, designed for early experimentation. While functional, it had limitations in scalability and execution speed due to reliance on free compute nodes provided by Forward Research and other contributors.\nMainnet (AO-Core): The production-ready, high-performance version of AO. AO-Core is the modular execution layer that ensures decentralized computation, state integrity, and verifiability on Arweave. HyperBEAM is the client implementation for AO-Core.\n\nAO-Core\nAO-Core is a protocol for decentralized computation, designed to support multiple computational models rather than enforcing a single architecture. It provides a framework where different execution models can be integrated.\nAO-Core’s key components include:\n\nHashpaths – A way to reference a program’s state before execution using Merklized lists of inputs and initial states.\nUnified state representation – Program states are structured as HTTP documents, ensuring compatibility with existing web protocols.\nAttestations – Nodes can verify and challenge each other’s representations of program states, enabling cryptographic and economic mechanisms for trust.\nMeta-VM – A flexible environment that allows multiple virtual machines and computational models to run within AO-Core while maintaining a unified format for state verification.\n\nHyperBEAM\nHyperBeam is a client implementation of the AO-Core protocol, functioning as the node software for AO’s decentralized operating system. It abstracts hardware details, allowing programs to run seamlessly across the network.\nNode operators can offer their machine’s computing power by running different devices and charging users for execution. Each HyperBeam node is configured using the ~meta@1.0 device, which manages hardware specs, supported devices, metering, and payments.\n→ More details on the latest HyperBEAM milestone\nHow AO scales\nUnlike traditional blockchains, AO is designed for large-scale execution with:\n\nParallel Processing – Processes run simultaneously, avoiding bottlenecks.\nUnlimited Computation – No cap on size or complexity; users pay only for what they use.\nAutonomous Execution – Processes can schedule tasks and operate independently.\n\nHow message passing works on AO\nAO uses a fundamentally different approach to sending transactions. Instead of relying on shared memory, smart contracts on AO operate as independent, asynchronous processes.\n\nEach contract runs independently and communicates with others by sending messages.\nThese messages are stored permanently and verifiably on Arweave, ensuring security and transparency.\n\nThis design removes the need for a global memory space where processes compete for access, effectively eliminating lock contention.\n→ Learn more about AO message passing\nWhat can I do now on AO?\nFor builders, there is a wealth of resources available for building on AO. Check out the AO Cookbook for step-by-step guides on how to build with the hyper-parallel computer. Visit the Learn page to see the full ecosystem developer resources.\nFor users, the permaweb ecosystem is growing with DeFi, gaming, content creation applications, and more. Visit the Explore page to see the full ecosystem.\nIf you’re looking to dive deeper into the permaweb, check out the Permaweb Index to learn about a novel funding mechanism for the ecosystem. Builders can generate funding by fair launching a token, and users can support projects by contributing yield-bearing assets in exchange for project tokens. Please note that the Permaweb Index is a permissionless mechanism, so be sure to do your own research. This is not financial advice.\nResources\nAO\n\nWebsite\nAO Cookbook\nMirror\nX\n\nFurther reading\n\nAO core components\nAO Tokenomics\nHow to allocate AO yield\n"},"reference/arweave-mining":{"title":"Arweave Mining","links":[],"tags":[],"content":"Mining on the Arweave network is designed to ensure that data stored on the network is replicated as widely as possible. Here’s a breakdown from a high level perspective. If you would like to start mining, see the mining documentation here.\nWhat Is Mining on Arweave?\nMining on Arweave involves helping maintain the network by storing data and creating new blocks. Instead of focusing only on computing power like traditional mining systems (e.g., Bitcoin), Arweave rewards miners for both computational effort and the amount of data they store.\nHow Mining Works\n\nRandom Data Challenge: Miners are challenged to prove they can access specific pieces of data (called a “challenge byte”) stored on the network.\nProof of Access (SPoRA): To pass the challenge, miners must retrieve and verify the required data from their storage.\nBlock Creation: Miners use the verified data to create a block and submit it to the network. The block is only accepted if it meets the network’s difficulty requirements.\n\nIncentives for Miners\n\nWide Data Replication: Miners are rewarded for storing more data. The more data you store, the higher your chances of successfully completing challenges and earning rewards.\nRare Data Storage: The network prioritizes less-replicated data, encouraging miners to store data that isn’t widely available. This ensures a balanced and well-replicated dataset across the network.\nSacrifice Mining: Some miners may choose to commit unique data that only they store, which can increase their chances of earning rewards.\n\nWhy Is This Important?\nThis approach ensures Arweave’s network remains highly decentralized and economically secure. It incentivizes miners to store data reliably and replicate it widely, making the stored information more accessible and resilient over time.\nBy combining innovative mining mechanisms with sustainable incentives, Arweave’s design supports its mission of providing permanent and decentralized data storage."},"reference/arweave":{"title":"Arweave 101","links":["reference/storage-endowment","reference/arweave-mining"],"tags":[],"content":"Arweave is the first protocol to enable permanent data storage, allowing users to preserve data forever with a single, one-time fee. Curious about how it works and why it matters? Let’s explore.\nWhat is Arweave?\nArweave is a decentralized protocol designed for permanent storage of data. Instead of relying on recurring payments like traditional cloud services, Arweave requires a one-time payment to store your data forever.\nThe protocol is secured by a network of miners who store and replicate data in exchange for rewards in the AR token. These rewards are funded through Arweave’s storage endowment, ensuring your data is always accessible, backed by an immutable and transparent economic model.\nAt its core is the permaweb, a global, unbounded web of pages and applications that exist permanently, free from centralized control\nHow does Arweave work?\nArweave’s design combines an unique data structure called the blockweave with an economic model based on a sustainable storage endowment. Here’s a simplified breakdown:\n\nData Storage: When you upload data, it’s bundled into blocks and added to the blockweave, a blockchain-like structure optimized for storage.\nProof of Access (SPoRA): Miners must verify not only new data but also randomly selected older data to create new blocks. This ensures data is continually replicated and remains available.\nStorage Endowment: Your one-time payment contributes to a long-term fund, enabling miners to store your data indefinitely as storage costs decrease over time.\n\nResources\nArweave\n\nWebsite\nArweave Docs\nGitHub\nYellow Paper\nX\nr/Arweave\n\nRelated Articles\n\nStorage Endowment\nMining\n"},"reference/atomic-assets":{"title":"Atomic Assets","links":[],"tags":[],"content":"Atomic Assets are unique digital items stored on the permaweb, designed to simplify the ownership and transfer of digital assets while ensuring security and permanence. Unlike traditional NFTs, the data of an atomic asset—its metadata and smart contract—are uploaded together in a single, inseparable transaction. This eliminates reliance on external components, unlike other blockchains where these elements are often stored separately and linked by the smart contract.\nAtomic Assets can represent anything from art, music, and videos to applications, domain names, or memberships.\nHow Do Atomic Assets Work?\nAn Atomic Asset consists of the following components:\n\n\nAO Token Process\n\nAtomic assets are defined as AO processes that adhere to the AO Token Blueprint)This ensures compliance with standards for token creation, transfer, and ownership management.\n\n\n\nMetadata\n\nMetadata describes the asset and follows the ANS-110 Standard. Required metadata includes:\n\nName: The asset’s name.\nTicker: A unique identifier for the asset.\nDenomination: The smallest divisible unit of the asset.\nCreator: The asset’s creator.\nCollection: (Optional) The Collection ID if the asset belongs to a group.\n\n\n\n\n\nTransferibility\n\nAssets may optionally be non-transferable, in which case only the creator or AO system can modify their state.\n\n\n\nData\n\nAtomic Assets include the actual data they represent (e.g., digital artwork, application code, or metadata) within their transaction.\n\n\n\nUse Cases\n\nDigital Art:\nRepresent and trade unique pieces of digital artwork with embedded metadata.\nTokenized Applications:\nCreate tokens tied to software or application processes.\nMemberships:\nUse Atomic Assets as non-transferable membership tokens with specific privileges.\nDomain Names:\nTokenize and manage ownership of decentralized domain names.\n\nBy integrating metadata, tokenization, and state management into a unified framework, Atomic Assets offer a robust and scalable solution for representing and managing digital items within the AO/Arweave ecosystem. This specification ensures interoperability and permanence, creating a reliable foundation for developers and users."},"reference/gateways":{"title":"Gateways","links":[],"tags":[],"content":"What Are Gateways?\nGateways are tools that connect the Arweave network, where data is stored permanently, to the internet. They simplify uploading, accessing, and searching for data on the Arweave network, eliminating the need for technical expertise. Think of them as bridges between the blockchain world and everyday web use.\nHow to Use Gateways\nThe permaweb can be accessed through over 250 AR.IO gateways. Gateways act as a bridge between the Arweave network and the outside world by streamlining the processes of reading, writing, and discovering data on Arweave.\nPopular Gateways\n\nao.arweave.net/\nao.ar.io/\nao.g8way.io/\nao.aoweave.tech/\nao.g8way.0rbit.co/\nao.frostor.xyz/\nao.permagate.io/\nao.arbr.pro/\nao.ar-io.dev/\nao.arweave.dev/\n\nTips for Using Gateways\n\nao.arweave.dev/ - is a development gateway and not recommended for production use.\nIf an application has trouble loading on one gateway, try switching to another.\nSee the full gateway list here.\n\nFor more details about AR.IO gateways, visit the ar.io gateway documentation."},"reference/media":{"title":"Media","links":[],"tags":[],"content":"Media Coverage\n2025\n\n[Feb 8] Arweave’s computing platform AO goes live on mainnet - The Block\n[Jan 27] Arweave 2.9 Upgrade Introduces Breakthrough Data Preparation Algorithm - BusinessWire\n[Jan 15] Arweave loads data onto lunar lander headed to the moon, meant to last for thousands of years - The Block\n\n2024\n\n[Nov 14] Arweave 2.8: A Major Upgrade for the Permaweb - BusinessWire\n[April 12]  Community Labs Launches $35M AO Ventures Incubator Program for Arweave Ecosystem- Yahoo Finance\n[Feb 27]  Arweave launches public testnet for ‘hyper parallel’ AO protocol -  Crypto Briefing\n"},"reference/permaweb":{"title":"Permaweb Guide","links":["reference/arweave","reference/gateways","reference/ao","reference/udl","reference/atomic-assets","reference/zones"],"tags":[],"content":"The permaweb is a permanent and decentralized web built on top of Arweave. The original vision of the traditional web was to create an accessible repository of human knowledge. While it has been largely successful, a critical flaw remains: the web lacks permanence. When documents are removed from a server, they are lost to the collective knowledge base. Similarly, applications that once operated on the web become inaccessible when their developers or maintainers alter or remove them.\nArweave addresses this issue with the permaweb, which can host fully decentralized web applications. These applications operate independently within the permaweb, governed solely by their own code. No individual or authority can oversee or alter them once launched. A permaweb application is immutable, universally accessible, and requires no ongoing maintenance or upkeep from the original developer to remain functional.\nThe permaweb provides a comprehensive stack for building and running these applications:\n\nArweave : The core system that ensures data replication and availability through a decentralized, sustainable endowment.\nGateways: Content delivery servers with diverse business models and incentives (e.g., arweave.net, ar.io, g8way.io, and aoweave.tech).\nGraphQL: A querying system offered by gateways, enabling seamless interaction with the network’s data. Developers can use GraphQL to search posts by users, filter data by tags or timestamps, and more, much like traditional web applications.\nAO: A hyper-parallel computational layer that provides a unified environment for decentralized applications and processes.\n\nThe Composable Web\nOn the traditional web, data is often locked within specific applications, creating isolated “data silos.” In contrast, permaweb applications share access to Arweave’s robust data lake, enabling composable applications—apps that can seamlessly leverage and build on each other’s data.\nPermaweb apps can be built on open protocols such as Stamps (a universal “like” button), Vouch (proof of humanity), and the Universal Content Marketplace (a decentralized order book), among others.\nMore User Control\nWith the Universal Data License (UDL), users can programmatically define within Atomic Assets how their data can be accessed and used by applications. Zones serve as an additional abstraction layer, storing information such as composable user profiles. This ensures that user rights are respected while providing developers with clear, equitable guidelines for building on existing content. The permaweb fosters a more open, collaborative, and fair ecosystem for both users and developers.”"},"reference/storage-endowment":{"title":"Storage Endowment","links":[],"tags":[],"content":"Arweave’s core function is to provide permanent storage for data. To make this possible, the network uses an innovative pricing mechanism that ensures data can be stored indefinitely while maintaining economic sustainability.\nHow is the Cost of Storage Calculated?\nData storage costs have been consistently decreasing over the past 50 years. This trend, known as the declining GBh cost (cost to store 1 GB of data for an hour), has dropped at an average annual rate of 30.57%.\n\nUsing this trend, Arweave calculates the cost of perpetual data storage by summing the declining costs over time. This makes it possible to charge users a one-time upfront fee for permanent storage, with the expectation that the declining costs of storage will cover data preservation forever.\nThe Storage Endowment\nTo ensure that the data remains permanently stored, Arweave uses a storage endowment system. This system distributes tokens to miners over time, incentivizing them to continue storing data sustainably.\nHow Does Transaction Pricing Work?\nEvery transaction on Arweave includes two components:\n\nPerpetual Storage Cost: A conservative estimate of the storage cost for the data being uploaded.\nTransaction Reward: An instant reward given to miners for including the transaction in a block.\n\nThis dual system ensures both immediate and long-term incentives for miners to keep the network running smoothly.\nEnsuring Miner Sustainability\nMiners are rewarded through three main mechanisms:\n\nTransaction Fees: Paid directly by users when uploading data.\nInflation Rewards: A pre-defined number of tokens released at each block.\nEndowment Rewards: Tokens drawn from the storage endowment if transaction fees and inflation rewards don’t cover the costs of maintaining the network.\n\nThe storage endowment acts as a financial buffer, ensuring that miners remain profitable even during periods of fluctuating token prices or network activity.\nFuture Data Density and Storage Reliability\nArweave’s model relies on the assumption that data storage costs will continue to decline. There are several reasons to believe this trend will persist:\n\nData Density Improvements: Storage technology still has immense room for growth, with theoretical limits far beyond current capabilities.\nReliability Advancements: Storage mediums are becoming more reliable, reducing costs over time.\nIncentives for Innovation: As global demand for data grows, so does the push to develop cheaper and more efficient storage technologies.\n\nThese factors ensure that Arweave’s economic model remains viable for decades (if not centuries) into the future.\nData Permanence vs. Network Permanence\nIt’s important to note that Arweave’s goal is data permanence, not necessarily the indefinite operation of the network itself. Like all technologies, Arweave may eventually be replaced by a newer system better suited to the challenges of the time.\nHowever, this doesn’t mean the data will be lost. The information stored on Arweave is cryptographically linked and widely replicated, making it highly resilient. If a future system emerges, it’s likely that Arweave’s data will be subsumed into that system, just as older archives have been integrated into modern digital systems.\nFor example:\n\nEarly internet protocols like Gopherspace are now archived on the Arweave permaweb.\nSimilarly, the Library of Congress and countless other archives have been digitized and preserved on the modern web.\n\nArweave anticipates that its data will follow this same pattern, ensuring long-term preservation through replication and the incentives it has created for permanent storage."},"reference/ucm":{"title":"Universal Content Marketplace (UCM)","links":["reference/permaweb","reference/atomic-assets","reference/udl","reference/vouch","reference/zones"],"tags":[],"content":"The Universal Content Marketplace (UCM) is a protocol on the permaweb designed for the trustless exchange of atomic assets. It enables creators and users to trade digital content, including images, music, videos, papers, components, and applications.\nHow the UCM works\nThe UCM processes transactions by accepting deposits from buyers or sellers and fulfilling orders based on the specified swap pair, quantity, and, if applicable, price. Here’s how an order is executed:\n\nA user deposits (transfers) tokens to the UCM, including additional tags in the Transfer Message. These tags are forwarded to the UCM process to create the order.\nThe token process issues a Credit-Notice to the UCM and a Debit-Notice to the user.\nThe Credit-Notice Handler verifies that all required tags are present before creating the order.\nThe UCM submits the order to the order book, using the forwarded tags to define the swap pair, token quantity, and price (for limit orders).\n\nA key feature of UCM is its incentive mechanism through PIXL, a rewards token. Users earn PIXL by maintaining buying streaks - purchasing atomic assets on consecutive days.\nCore Functionality\n\nPowered by AO – The UCM operates on AO, a hyper-parallel computing system built on Arweave. AO provides a unified environment for executing decentralized applications and processes.\nTrustless Transactions – Eliminates third-party intermediaries in digital asset exchanges.\nLicensable Data – The Universal Data License (UDL) ensures that value flows equitably to creators and contributors. Creators can set their own terms for content usage. Learn more about UDL here.\nEarn $PIXL Rewards – Users who maintain buying streaks earn PIXL rewards. The longer the streak, the greater the daily reward. Learn more about earning PIXL here.\n\nUCM Fees\nThe UCM captures a 0.5% fee per transaction. If the trade involves $wAR tokens, the fee is used to purchase PIXL tokens through the following process:\n\nThe contract buys available PIXL sell orders.\nPurchased PIXL tokens are burned, reducing the overall supply.\n\nHigher trading volumes increase buy pressure on PIXL, enhancing scarcity over time.\nResources\n\nUCM Source Code\nBazar (UCM UI)\n\nRelated Articles\n\nPermaweb\nAtomic Assets\nUniversal Data License\nVouch\nZones\n"},"reference/udl":{"title":"Universal Data License (UDL)","links":[],"tags":[],"content":"The Universal Data License defines the terms and conditions for using media assets on the permaweb. The UDL establishes a framework for licensing digital media such as images, videos, audio, graphics and more. Instead of platforms setting the terms and conditions, on the permaweb creators define how their media can be utilized.\nUDL parameters explained:\n\nAccess Fee - Fee a user must pay to access the content\n\nOne time - Pay once to access content forever.\n\n\nDerivations - Allow or disallow other creators to derive media based on your work. Derivative works are works that alters, adapts, amends, transforms or adjusts the original work.\n\nWith credit - The Licensee must credit and link to the original work.\nWith indication - The Licensee must indicate that their work is a derivative work.\nWith License Passthrough - Licensee shall only allow the use of a Derivation to third parties under the same terms and conditions as under the original license.\nWith Revenue Share - the Licensee shall pay the stated percentage to the Licensor from the revenue received from third parties for the derivative work.\nWith Monthly Fee - The Licensee must pay the Licensor a monthly fee to continue using the derivative work.\nWith One-Time Fee - The Licensee must pay the Licensor a one time fee before creating a derivative work.\n\n\nCommercial Use - Allow or disallow the use of the content for commercial use. Commercial use refers to using the media for anything other than personal and non-commercial purposes. This includes any use that aims to make money or gain some form of commercial benefit.\n\nWith Revenue Share - the Licensee shall pay the stated percentage to the Licensor from the revenue received from third parties for the commercial use Media.\nWith Monthly Fee - The Licensee must pay the Licensor a monthly fee to continue using the commercial use Media.\nWith One-Time Fee - The Licensee must pay the Licensor a one time fee to use the commercial-use Media.\n\n\nData Model Training - Allow or disallow the reproduction and use of your content for data model training.\n\nWith Monthly Fee - The Licensee must pay the Licensor a monthly fee to continue using the Media for data model training.\nWith One-Time Fee - The Licensee must pay the Licensor a one time fee to use the Media for data model training.\n\n\nPayment Mode - The wallet address in which UDL payments are to be made to.\n\nSingle - All payments go to the indicated address\nRandom - Payments are distributed randomly between wallet addresses proportional to their respective holdings of the asset.\nGlobal - Payments are distributed evenly between wallet addresses proportional to their respective holdings of the asset.\n\n\n\nLinks\n\nUDL v0.1 Announcement Post\nUDL v0.2 Announcement Post\nFull UDL.\n"},"reference/vouch":{"title":"Vouch","links":[],"tags":[],"content":"The Vouch Protocol is a decentralized system for proving identity and building trust within the Arweave and AO ecosystems. It helps prevent Sybil attacks, where a single entity creates multiple fake accounts to manipulate a system. By using the Vouch Protocol, we can verify that entities (such as users, wallets, or organizations) are real and trustworthy.\nWhy Does Sybil Resistance Matter?\nIn decentralized networks, Sybil attacks undermine fairness and security by allowing one person to act as multiple fake users. Sybil resistance protects these systems by verifying and limiting fake identities. The Vouch Protocol provides a standardized way to achieve this.\nKey Features\n\nDecentralized Trust: Confidence levels are determined collaboratively by VouchDAO members, ensuring no single party has control.\nCustomizable Verification: Supports multiple methods, including social media, email, and KYC.\nInteroperability: Works seamlessly with other AO and Arweave processes.\n\nHow to Use the Vouch Protocol\n\nVouching: Link wallets with trusted verification methods and submit them to the VouchDAO\nStaking: DAO members stake tokens to vote on the reliability of vouched wallets.\nConfidence Scores: Use confidence scores to evaluate trustworthiness for applications, services, or transactions.\n\nVouch Portal\nThe Vouch Portal is an open-source reputation system on AO that calculates a humanity score using a mix of:\n\nAO ecosystem data\nEthereum blockchain activity\nWeb2 social presence\n\nKey Benefits:\n\nVerifies genuine users for enhanced security.\nRewards reputation with prioritized benefits.\nEncourages positive ecosystem behavior.\n\nAdoption\nVouch is currently used by Bazar, Llama Land, and Permaverse. Other permaweb apps can integrate Vouch through the Developer Docs.\nHow to Earn Vouch Points\n1. Vouch X\n\nLink your Twitter/X account.\nPoints are awarded based on account criteria, such as age and activity.\nEach Twitter/X account can only be linked once.\n\n2. Vouch Gitcoin Passport\n\nUse Gitcoin Passport to aggregate blockchain activity, social profiles, and KYC data.\n\n3. Vouch AO Balance\n\nEarn points by holding AO tokens, bridging stETH, or holding DAI in the AO pre-bridge.\nThis method is valid until AO becomes tradable (~Feb 2025).\n\n4. Stake wAR\n\nEarn additional points by staking wAR in the Vouch Portal.\nPoints vary by staking duration and AR price. Tokens are securely stored and can be withdrawn after the lock period. See the staking contract here.\n\nSummary\nThe Vouch Protocol is a decentralized proof-of-humanity system that helps build trust by verifying identities within the AO ecosystem. It plays a vital role in protecting against fake accounts, ensuring fairness, and enabling more secure decentralized applications.\nWant to learn more? Explore the full Vouch Protocol Specification here.\nGet Vouched Here"},"reference/zones":{"title":"Zones","links":[],"tags":[],"content":"Zones are digital containers in the AO ecosystem that represent entities such as user profiles, organizations, or channels. They store information about these entities and can perform actions on their behalf. Think of them as programmable spaces where data and functionality are organized for a specific purpose.\nOne of the first use cases for Zones is AO Profiles. Profiles are digital representations of entities (e.g., users, organizations, or channels). They instantiate Zones with specific metadata describing the entity and can be associated with various digital assets and collections.\nWhy Do Zones Matter?\nAs AO and Arweave grow, there’s an increasing need for a standardized way to manage data and actions tied to different entities. Zones provide a flexible and consistent framework, enabling developers to build more powerful and interconnected applications while keeping everything organized and efficient.\nZones are built using a specific Data-Protocol to ensure consistency and interoperability across the ecosystem.\nWhat Can You Do With Zones?\nZones allow developers and users to:\n\nCreate custom profiles, organizations, or channels that interact seamlessly across the AO ecosystem.\nStore and manage data specific to these entities in a standardized way.\nBuild applications that leverage the information and assets managed by Zones.\n\nSummary\nZones are the foundation for creating modular, programmable entities in the AO ecosystem, with AO Profiles being one of the first use cases. Whether you’re a developer building an app or a user interacting with decentralized tools, Zones ensure everything stays organized, interoperable, and ready to scale.\nRead the Zone spec here."}}